<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>AtCoder CODE FESTIVAL 2017 qual C - Chielo&#39;s Blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">








    <meta name="description" content="&amp;#x53D1;&amp;#x73B0;&amp;#x80FD;&amp;#x529B;&amp;#x8FD8;&amp;#x662F;&amp;#x5DEE;&amp;#x4E00;&amp;#x4E9B;&amp;#xFF0C;&amp;#x4F9D;&amp;#x7136;&amp;#x9700;&amp;#x8981;&amp;#x52AA;&amp;#x529B;&amp;#xFF0C;&amp;#x52A0;&amp;#x6CB9;&amp;#x3002; &amp;#x7EFC;&amp;#x8FF0;&amp;#x603B;&amp;#x5171;6&amp;#x905">
<meta property="og:type" content="article">
<meta property="og:title" content="AtCoder CODE FESTIVAL 2017 qual C">
<meta property="og:url" content="https://chielonewctle.github.io/2017/10/22/atcoder-code-festival-2017-qualc/index.html">
<meta property="og:site_name" content="Chielo&#39;s Blog">
<meta property="og:description" content="&amp;#x53D1;&amp;#x73B0;&amp;#x80FD;&amp;#x529B;&amp;#x8FD8;&amp;#x662F;&amp;#x5DEE;&amp;#x4E00;&amp;#x4E9B;&amp;#xFF0C;&amp;#x4F9D;&amp;#x7136;&amp;#x9700;&amp;#x8981;&amp;#x52AA;&amp;#x529B;&amp;#xFF0C;&amp;#x52A0;&amp;#x6CB9;&amp;#x3002; &amp;#x7EFC;&amp;#x8FF0;&amp;#x603B;&amp;#x5171;6&amp;#x905">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2017-10-22T16:00:00.000Z">
<meta property="article:modified_time" content="2020-04-13T00:36:50.680Z">
<meta property="article:author" content="Chielo Newctle">
<meta property="article:tag" content="算法">
<meta property="article:tag" content="Atcoder">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/favicon.ico">


<link rel="stylesheet" href="//fonts.loli.net/css?family=Source+Code+Pro|Noto+Serif+SC|Noto+Sans+SC|Roboto+Condensed">
<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.loli.net/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">



<link rel="stylesheet" href="/css/leaves.css">


<script defer src="//cdn.bootcss.com/font-awesome/5.8.1/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<script src="//cdnjs.loli.net/ajax/libs/jquery/3.3.1/jquery.min.js"></script>

<meta name="generator" content="Hexo 4.2.0"><link rel="alternate" href="/atom.xml" title="Chielo's Blog" type="application/atom+xml">
</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    <img src="/assets/about/avatar.jpg" alt="" height="28">
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/">主页</a>
            
            <a class="navbar-item "
               href="/archives">归档</a>
            
            <a class="navbar-item "
               href="/categories">分类</a>
            
            <a class="navbar-item "
               href="/tags">标签</a>
            
            <a class="navbar-item "
               href="/cheat-sheet">技巧</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#">1&nbsp;&nbsp;<b>综述#</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">2&nbsp;&nbsp;<b>题意和题解#</b></a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.1&nbsp;&nbsp;A.  Can you get AC?#</a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.2&nbsp;&nbsp;B. Similar Arrays#</a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.3&nbsp;&nbsp;C. Inserting ‘x’#</a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.4&nbsp;&nbsp;D. Yet Another Palindrome Partitioning (dp)#</a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.5&nbsp;&nbsp;E. National Property (sweep line)#</a>
                    
                    
                    
                    <a class="navbar-item" href="#">2.6&nbsp;&nbsp;F. Three Gluttons (dp)#</a>
                    
                </div>
            </div>
            
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            AtCoder CODE FESTIVAL 2017 qual C
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2017-10-22T16:00:00.000Z" itemprop="datePublished">10月 22 2017</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/%E6%AF%94%E8%B5%9B%E8%AE%B0%E5%BD%95/">比赛记录</a>
        </span>
        
        
        
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x53D1;&#x73B0;&#x80FD;&#x529B;&#x8FD8;&#x662F;&#x5DEE;&#x4E00;&#x4E9B;&#xFF0C;&#x4F9D;&#x7136;&#x9700;&#x8981;&#x52AA;&#x529B;&#xFF0C;&#x52A0;&#x6CB9;&#x3002;</p>
<h3><span id="zong-shu">&#x7EFC;&#x8FF0;</span><a href="#zong-shu" class="header-anchor">#</a></h3><p>&#x603B;&#x5171;6&#x9053;&#x9898;&#xFF0C;&#x524D;&#x56DB;&#x9053;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x540E;&#x4E24;&#x9053;&#x6CA1;&#x6CD5;&#x4E0B;&#x624B;&#xFF0C;&#x6700;&#x540E;&#x505A;&#x51FA;4&#x9898;&#x3002;&#x68C0;&#x67E5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x592A;&#x8BA4;&#x771F;&#xFF0C;&#x7206;&#x4E86;&#x51E0;&#x53D1;&#xFF0C;&#x4E0B;&#x6B21;&#x5E94;&#x8BE5;&#x591A;&#x6CE8;&#x610F;&#x3002;</p>
<a id="more"></a>

<h3><span id="ti-yi-he-ti-jie">&#x9898;&#x610F;&#x548C;&#x9898;&#x89E3;</span><a href="#ti-yi-he-ti-jie" class="header-anchor">#</a></h3><h4><span id="a-can-you-get-ac">A.  Can you get AC?</span><a href="#a-can-you-get-ac" class="header-anchor">#</a></h4><p>&#x7ED9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x67E5;&#x662F;&#x5426;&#x6709;&#x5B50;&#x4E32; <code>&quot;AC&quot;</code>&#x3002;</p>
<h4><span id="b-similar-arrays">B. Similar Arrays</span><a href="#b-similar-arrays" class="header-anchor">#</a></h4><p>&#x5B9A;&#x4E49;&#x4E24;&#x6570;&#x7EC4;&#x201C;&#x76F8;&#x4F3C;&#x201D;&#xFF0C;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x5143;&#x7D20;&#x7684;&#x7EDD;&#x5BF9;&#x5DEE;&#x5C0F;&#x4E8E;1&#x3002;&#x7ED9;&#x4E2A;&#x6570;&#x7EC4;&#x6C42;&#x591A;&#x5C11;&#x79CD;&#x6570;&#x7EC4;&#x548C;&#x5B83;&#x76F8;&#x4F3C;&#xFF0C;&#x5E76;&#x4E14;&#x90A3;&#x4E9B;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x79EF;&#x4E3A;&#x5076;&#x6570;&#x3002;</p>
<p>&#xFF08;&#x6211;&#x2026;&#x2026;&#x56E0;&#x4E3A; \(N\) &#x592A;&#x5C0F;&#x4E86;&#xFF0C;&#x5F53;&#x573A;&#x76F4;&#x63A5;&#x4EA4;&#x641C;&#x7D22;&#x2026;&#x2026;&#xFF09;</p>
<p>&#x4F1A;&#x53D1;&#x73B0;&#x76F4;&#x63A5;&#x7B97;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x56F0;&#x96BE;&#x3002;&#x9006;&#x5411;&#x8003;&#x8651;&#xFF0C;&#x82E5;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x79EF;&#x4E3A;&#x5947;&#x6570;&#xFF0C;&#x90A3;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5176;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x5076;&#x6570;&#x5143;&#x7D20;&#xFF1B;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x8FD8;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x539F;&#x6570;&#x7EC4;&#x6BCF;&#x4E00;&#x4F4D;&#x7684;&#x5947;&#x5076;&#x53EF;&#x4EE5;&#x770B;&#x8FD9;&#x4E00;&#x4F4D;&#x7F6E;&#x80FD;&#x53D6;&#x5F97;&#x5143;&#x7D20;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x4E58;&#x8D77;&#x6765;&#x3002;&#x7B54;&#x6848;&#x5C31;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x603B;&#x6570; \(3^N\)&#xFF0C;&#x518D;&#x51CF;&#x53BB;&#x4E58;&#x79EF;&#x4E3A;&#x5947;&#x6570;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x76EE;&#x3002;</p>
<h4><span id="c-inserting-x">C. Inserting &#x2018;x&#x2019;</span><a href="#c-inserting-x" class="header-anchor">#</a></h4><p>&#x7ED9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BA9;&#x901A;&#x8FC7;&#x6700;&#x5C11;&#x6B21;&#x6570;&#x7684;&#x63D2;&#x5165; <code>&apos;x&apos;</code> &#x7684;&#x64CD;&#x4F5C;&#x628A;&#x5B83;&#x6574;&#x6210;&#x4E00;&#x4E2A;&#x56DE;&#x6587;&#x4E32;&#x3002;</p>
<p>&#x8003;&#x8651;&#x8BA9;&#x9996;&#x5C3E;&#x4E24;&#x5143;&#x7D20;&#x4E00;&#x81F4;&#xFF0C;&#x5728;&#x4E24;&#x7AEF;&#x90FD;&#x63D2; x &#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x7AEF;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x540C;&#x3001;&#x4E14;&#x90FD;&#x4E0D;&#x4E3A; x&#xFF0C;&#x90A3;&#x65E0;&#x8BBA;&#x600E;&#x4E48;&#x64CD;&#x4F5C;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x56DE;&#x6587;&#x4E32;&#x4E86;&#xFF1B;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x662F; x&#xFF0C;&#x90A3;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x5934;&#x63D2;&#x4E2A; x&#xFF0C;&#x8BA9;&#x9996;&#x5C3E;&#x5148;&#x76F8;&#x540C;&#xFF0C;&#x8FD9;&#x6837;&#x9996;&#x5C3E;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x8003;&#x8651;&#x4E86;&#xFF0C;&#x5220;&#x6389;&#x3002;&#x628A;&#x8FD9;&#x6837;&#x7684;&#x82E5;&#x5E72;&#x6B21;&#x64CD;&#x4F5C;&#x653E;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x641E;&#x6389;&#x4E24;&#x5934;&#x7684; x&#xFF0C;&#x641E;&#x6389;&#x4E24;&#x5934;&#x76F8;&#x540C;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x518D;&#x5F80;&#x590D;&#x8FD9;&#x4E48;&#x641E;&#x3002;&#x76F8;&#x5F53;&#x4E8E;&#x628A;&#x6240;&#x6709; x &#x90FD;&#x5220;&#x6389;&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x73B0;&#x5728;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x4E0D;&#x662F;&#x56DE;&#x6587;&#x7684;&#xFF0C;&#x201C;&#x4E0D;&#x662F;&#x201D;&#x5C31;&#x6CA1;&#x6CD5;&#x64CD;&#x4F5C;&#x6210;&#x56DE;&#x6587;&#x7684;&#xFF1B;&#x201C;&#x662F;&#x201D;&#x7684;&#x8BDD;&#x5C31;&#x8003;&#x8651;&#x5B57;&#x7B26;&#x95F4;&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x5728;&#x6BCF;&#x5BF9;&#x5BF9;&#x79F0;&#x4F4D;&#x7F6E;&#x4E0A;&#x63D2; x&#xFF0C;&#x8BA9;&#x5B57;&#x7B26;&#x4E32;&#x53D8;&#x6210;&#x56DE;&#x6587;&#x7684;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x6BCF;&#x5BF9;&#x5BF9;&#x79F0;&#x7684;&#x7A7A;&#x9699;&#x6240;&#x9700;&#x7684;&#x6700;&#x5C11;&#x7684;&#x64CD;&#x4F5C;&#x6B21;&#x6570;&#xFF0C;&#x5373;&#x662F;&#x4E24;&#x4E2A;&#x7A7A;&#x9699;&#x5185;&#x539F;&#x6709;&#x7684; x &#x6570;&#x76EE;&#x7684;&#x7EDD;&#x5BF9;&#x5DEE;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x6240;&#x9700;&#x7684;&#x6700;&#x5C11;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x3002;</p>
<h4><span id="d-yet-another-palindrome-partitioning-dp">D. Yet Another Palindrome Partitioning (dp)</span><a href="#d-yet-another-palindrome-partitioning-dp" class="header-anchor">#</a></h4><p>&#x7ED9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BA9;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x5206;&#x6210;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x5757;&#xFF0C;&#x4F7F;&#x5F97;&#x6BCF;&#x5757;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x56DE;&#x6587;&#x4E32;&#x7684;&#x91CD;&#x6392;&#x5217;&#x3002;</p>
<p>&#x56DE;&#x6587;&#x4E32;&#x7684;&#x91CD;&#x6392;&#x5217;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6BCF;&#x79CD;&#x5B57;&#x7B26;&#x51FA;&#x73B0;&#x6B21;&#x6570;&#x90FD;&#x4E3A;&#x5076;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x591A;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x51FA;&#x73B0;&#x5947;&#x6570;&#x6B21;&#x3002;&#x56E0;&#x4E3A;&#x90FD;&#x662F;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;26&#x79CD;&#x5B57;&#x7B26;&#x51FA;&#x73B0;&#x5947;&#x5076;&#x6B21;&#x7684;&#x72B6;&#x6001;&#x5B58;&#x6210;&#x6574;&#x6570;&#xFF1B;&#x5E76;&#x4E14;&#x82E5;&#x7EF4;&#x62A4;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x524D;&#x7F00;&#x548C; \(s_i\)&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5F02;&#x6216;&#x65B9;&#x4FBF;&#x5730;&#x5F97;&#x5230;&#x6240;&#x6709;&#x5757;&#x7684;&#x5947;&#x5076;&#x6B21;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8BB0; \({dp}_i\) &#x4E3A;&#x524D;&#x7F00; \(1 \cdots i\) &#x7684;&#x6700;&#x5C11;&#x5206;&#x5757;&#x6570;&#x76EE;&#xFF0C;\(bc(x)\) &#x4E3A; \(x\) &#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7684;1&#x7684;&#x6570;&#x76EE;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230;<br>\[{dp}_i = \min\limits_{\substack{1 \le j &lt; i \ bc(s_i \oplus s_j) \le 1}} + 1\]<br>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A; \(i\)&#xFF0C;&#x679A;&#x4E3E; \(b\)&#xFF0C;&#x627E;&#x6240;&#x6709;&#x7684; \(j: s_i \oplus s_j = b\)&#xFF0C;&#x5373;&#x627E;&#x5947;&#x5076;&#x6B21;&#x72B6;&#x6001;&#x7B49;&#x4E8E; \(s_i \oplus b\) &#x7684; \(dp_j\) &#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5F00;&#x4E2A; unordered_map&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x5B58;&#x4E00;&#x4E0B; \(s_i\) &#x5BF9;&#x5E94;&#x7684;&#x6700;&#x5C0F;&#x7684; \(dp_i\) &#x5C31;&#x53EF;&#x4EE5; \(\mathcal{O}(\Sigma*)\) &#x65F6;&#x95F4;&#x5185;&#x8F6C;&#x79FB;&#x4E86;&#x3002;</p>
<h4><span id="e-national-property-sweep-line">E. National Property (sweep line)</span><a href="#e-national-property-sweep-line" class="header-anchor">#</a></h4><p>&#x7ED9;&#x4E2A;&#x7531; \(1 \times 1 \times 1\) &#x7684;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x642D;&#x6210;&#x7684; \(A \times B \times C\) &#x5927;&#x957F;&#x65B9;&#x4F53;&#xFF08;<strong>\(A, B, C\) &#x4E24;&#x4E24;&#x4E92;&#x8D28;</strong>&#xFF09;&#xFF0C;&#x5E73;&#x884C;&#x4E8E;&#x5750;&#x6807;&#x8F74;&#x653E;&#x7F6E;&#xFF0C;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x5728; \((0, 0, 0)\)&#xFF0C;&#x5BF9;&#x9762;&#x7684;&#x5728; \((A, B, C)\)&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x95F4;&#x7A7F;&#x4E00;&#x6839;&#x7EBF;&#xFF1B;&#x7ED9;&#x6BCF;&#x4E2A;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x6807;&#x8BB0;&#x4E00;&#x4E2A;&#x5750;&#x6807;&#xFF0C;&#x53D6;&#x5176;&#x5750;&#x6807;&#x5206;&#x91CF;&#x6700;&#x5C0F;&#x7684;&#x9876;&#x70B9;&#x4E3A;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x6700;&#x9760;&#x8FD1;&#x539F;&#x70B9;&#x7684;&#x90A3;&#x4E2A;&#x8BB0;&#x4E3A; \((0, 0, 0)\)&#xFF1B;&#x8BB0;&#x4E24;&#x4E2A;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x5750;&#x6807;&#x7684;&#x5207;&#x6BD4;&#x96EA;&#x592B;&#x8DDD;&#x79BB;&#xFF08;&#x5404;&#x5750;&#x6807;&#x7EDD;&#x5BF9;&#x5DEE;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x503C;&#xFF09;&#x4E3A;&#x4E24;&#x7ACB;&#x65B9;&#x4F53;&#x8DDD;&#x79BB;&#x3002;&#x95EE;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x7ACB;&#x65B9;&#x4F53;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x3001;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x8DDD;&#x79BB;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; \(D\)&#x3002;</p>
<p>&#xFF08;&#x6BD4;&#x8D5B;&#x65F6;&#x8BFB;&#x5B8C;&#x9898;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x601D;&#x8DEF;&#x3002;&#xFF09;</p>
<p>&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7ED3;&#x8BBA;&#x662F;&#xFF0C;&#x7EBF;&#x5728;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x95F4;&#xFF0C;&#x53EA;&#x4F1A;&#x7ECF;&#x8FC7;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x201C;&#x9762;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x7ECF;&#x8FC7;&#x68F1;&#x3001;&#x9876;&#x70B9;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x7EBF;&#x8868;&#x793A;&#x6210;&#x53C2;&#x6570;&#x65B9;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x4EE4;&#x67D0;&#x4E00;&#x7EF4;&#x5750;&#x6807;&#x503C;&#x4E3A;&#x6574;&#x6570;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x53E6;&#x5916;&#x4E24;&#x7EF4;&#x5728;&#x9876;&#x70B9;&#x95F4;&#x90FD;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x6574;&#x6570;&#xFF1B;&#x540C;&#x6837;&#x5BF9;&#x6BCF;&#x4E00;&#x7EF4;&#x8FD9;&#x6837;&#x8BA8;&#x8BBA;&#xFF0C;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x4E09;&#x4E2A;&#x5750;&#x6807;&#x503C;&#x4E24;&#x4E24;&#x95F4;&#x4E0D;&#x4F1A;&#x540C;&#x65F6;&#x4E3A;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x8BC1;&#x660E;&#x4E86;&#x4E0A;&#x8FF0;&#x7ED3;&#x8BBA;&#x3002;&#x7531;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x76F8;&#x90BB;&#x7684;&#x3001;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x5750;&#x6807;&#x95F4;&#xFF0C;&#x90FD;&#x662F;&#x67D0;&#x4E00;&#x7EF4;&#x5DEE;&#x4E2A;1&#xFF0C;&#x5177;&#x4F53;&#x662F;&#x54EA;&#x4E00;&#x7EF4;&#x53D6;&#x51B3;&#x4E8E;&#x7EBF;&#x662F;&#x7ECF;&#x8FC7;&#x4E86;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x54EA;&#x4E00;&#x9762;&#xFF1B;&#x8FD9;&#x6837;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x8BB0;&#x4E3A; \(P_0(x_0 = 0, y_0 = 0, z_0 = 0), \cdots, P_{n-1}(x_{n-1} = A-1, y_{n-1} = B-1, z_{n-1} = C-1)\)&#xFF0C;&#x56E0;&#x4E3A; \(P_{i}\) &#x548C; \(P_{i+1}\) &#x53EA;&#x6709;&#x4E00;&#x7EF4;&#x5DEE;&#x4E86;1&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x8D70;&#x4E86;&#x4E00;&#x4E2A;&#x66FC;&#x54C8;&#x987F;&#x8DEF;&#x5F84;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x5171; \(n = A+B+C-2\)&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x8003;&#x8651;&#x5927;&#x957F;&#x65B9;&#x4F53;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8BA9;&#x7A7A;&#x95F4;&#x5145;&#x6EE1;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x548C; \(P_0\) &#x5207;&#x6BD4;&#x96EA;&#x592B;&#x8DDD;&#x79BB;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; \(D\) &#x7684;&#x6240;&#x6709;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x5373;&#x7B26;&#x9898;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x53D1;&#x73B0;&#x603B;&#x6570;&#x662F; \((2D+1)^3\)&#xFF1B;&#x5982;&#x679C;&#x6309;&#x987A;&#x5E8F;&#x589E;&#x52A0; \(P_i\)&#xFF0C;&#x7B26;&#x9898;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x5728;&#x67D0;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x591A;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x4E3A;1&#x7684;&#x6241;&#x5E73;&#x7684;&#x957F;&#x65B9;&#x4F53;&#xFF0C;&#x4E14;&#x662F;&#x5728; \(P_{i-1}\) &#x5F80; \(P_i\) &#x8D70;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#xFF0C;&#x8DDD;&#x79BB;&#x4E3A; \(D\) &#x5904;&#xFF0C;&#x589E;&#x52A0;&#x7684;&#x8FD9;&#x4E9B;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x6700;&#x7B26;&#x9898;&#x7ACB;&#x65B9;&#x4F53;&#x603B;&#x6570;&#x7684;&#x8D21;&#x732E;&#x662F; \((2D+1)^2\)&#x3002;&#x5982;&#x679C;&#x5355;&#x7EAF;&#x8FD9;&#x4E48;&#x8003;&#x8651;&#xFF0C;&#x90A3;&#x4E48;&#x603B;&#x5171;&#x7684;&#x7B26;&#x9898;&#x7ACB;&#x65B9;&#x4F53;&#x6570;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x82E5;&#x52A0;&#x4E0A;&#x957F;&#x65B9;&#x4F53;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x53EA;&#x6709;&#x9760;&#x8FD1;&#x8FB9;&#x754C;&#x7684;&#x3001;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x8D21;&#x732E;&#x5BB9;&#x6613;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x9760;&#x8FD1;&#x4E2D;&#x5FC3;&#x7684;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x8D21;&#x732E;&#x5C31;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8D21;&#x732E;&#x4F1A;&#x53D8;&#x7684;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x5C0F;&#x7ACB;&#x65B9;&#x4F53;&#x8BB0;&#x4E3A;&#x5173;&#x952E;&#x70B9;&#xFF0C;&#x7528;&#x4E09;&#x4E2A;&#x5750;&#x6807;&#x5206;&#x91CF;&#x7684;&#x548C;&#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#x6392;&#x5E8F;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x626B;&#x63CF;&#x7EBF;&#x6765;&#x5904;&#x7406;&#x76F8;&#x90BB;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#x7684;&#x8D21;&#x732E;&#x3002;</p>
<p>&#x8BB0;&#x76F8;&#x90BB;&#x7684;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#x4E3A; \(P(x, y, z),, Q(x+\delta x, y+\delta y, z+\delta z)\)&#xFF0C;&#x5728; \(P,Q\) &#x95F4;&#x7684;&#x6240;&#x6709;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x589E;&#x957F;&#x7684;&#x90A3;&#x4E00;&#x4E9B;&#x5BF9;&#x7B54;&#x6848;&#x7684;&#x8D21;&#x732E;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x8BB0;&#x4E09;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x5BF9;&#x7B54;&#x6848;&#x7684;&#x8D21;&#x732E;&#x5206;&#x522B;&#x4E3A; \(F_x, F_y, F_z\)&#xFF0C;&#x5219;&#x5305;&#x62EC; \(P\) &#x4E0D;&#x5305;&#x62EC; \(Q\) &#x95F4;&#x7684;&#x6240;&#x6709;&#x88AB;&#x7EBF;&#x7A7F;&#x8FC7;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x603B;&#x8D21;&#x732E;&#x662F; \(F_x \delta x + F_y \delta y + F_z \delta z\)&#x3002;</p>
<p>&#x518D;&#x6DF1;&#x5165;&#x601D;&#x8003;&#xFF0C;&#x5728; \(P_{i-1}\) &#x8F6C;&#x5230; \(P_i\) &#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x82E5; \(P_{i-1}\) &#x662F;&#x5728; \(u \in {x, y, z}\) &#x65B9;&#x5411;&#x4E0A;&#x589E;&#x52A0;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x800C; \(P_{i-1}\) &#x7684; \(u\) &#x65B9;&#x5411;&#x4E0A;&#x7684;&#x5206;&#x91CF;&#x5C0F;&#x4E8E; \(D\)&#xFF0C;&#x6216;&#x8005;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; \(A - D - 1\)&#xFF0C;&#x5219;&#x7ACB;&#x65B9;&#x4F53; \(P_{i-1}\) &#x5FC5;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x679A;&#x4E3E;&#x4E09;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x5750;&#x6807;&#x6709;&#x53D8;&#x5316;&#x7684;&#x3001;&#x4E14;&#x79BB;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x8DDD;&#x79BB;&#x4E0D;&#x8D85;&#x8FC7; \(D\) &#x7684;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x6240;&#x6709;&#x7684;&#x5173;&#x952E;&#x70B9;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x70B9;&#x7684;&#x603B;&#x6570;&#x662F; \(\mathcal{O}(D)\) &#x7684;&#x3002;&#x8FD9;&#x6837;&#x4FBF;&#x80FD;&#x5728; \(\mathcal{O}(D\log{D})\) &#x65F6;&#x95F4;&#x5185;&#x5F97;&#x5230;&#x7B26;&#x9898;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x6570;&#x76EE;&#x4E86;&#x3002;</p>
<h4><span id="f-three-gluttons-dp">F. Three Gluttons (dp)</span><a href="#f-three-gluttons-dp" class="header-anchor">#</a></h4><p><em>UPDATED on 2017-11-08</em></p>
<p>&#x73B0;&#x5728;&#x6709; \(N=3n\) &#x4E2A;&#x5BFF;&#x53F8;&#xFF0C;&#x6709;&#x4E09;&#x4E2A;&#x4EBA; A, B, C&#xFF0C;&#x5404;&#x81EA;&#x6709;&#x4E2A;&#x5BFF;&#x53F8;&#x7684;&#x559C;&#x597D;&#x987A;&#x5E8F;&#x5217;&#x8868; \(a_i, b_i, c_i\)&#xFF0C;&#x4E09;&#x4E2A;&#x5217;&#x8868;&#x90FD;&#x662F; \(1\) &#x5230; \(N\) &#x7684;&#x6392;&#x5217;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#xFF0C;&#x8BBE;&#x662F;&#x7B2C; \(t\) &#x6B21;&#xFF0C;&#x4E09;&#x4E2A;&#x4EBA;&#x4F1A;&#x6309;&#x7740;&#x559C;&#x597D;&#x987A;&#x5E8F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF0C;&#x627E;&#x73B0;&#x5728;&#x8FD8;&#x5B58;&#x5728;&#x7684;&#x5BFF;&#x53F8;&#x7F16;&#x53F7; \(a_t, b_t, c_t\)&#xFF0C;&#x7136;&#x540E;&#x540C;&#x4E00;&#x4E2A;&#x5BFF;&#x53F8;&#x6700;&#x591A;&#x88AB;&#x4E00;&#x4E2A;&#x4EBA;&#x9009;&#x62E9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x5403;&#x6389;&#x8FD9;&#x4E09;&#x4E2A;&#x5BFF;&#x53F8;&#xFF0C;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x540C;&#x6837;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x5230;&#x5403;&#x5B8C;&#x6240;&#x6709;&#x7684;&#x5BFF;&#x53F8;&#x3002;&#x9898;&#x76EE;&#x5219;&#x662F;&#x7ED9;&#x51FA; A &#x548C; B &#x7684;&#x559C;&#x597D;&#x5217;&#x8868;&#xFF0C;&#x5728;&#x4E0D;&#x51FA;&#x73B0;&#x9009;&#x62E9;&#x7684;&#x5BFF;&#x53F8;&#x6709;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;C &#x7684;&#x559C;&#x597D;&#x5217;&#x8868;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x5148;&#x53EA;&#x8003;&#x8651;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x88AB; C &#x5403;&#x7684;&#x5BFF;&#x53F8;&#x7684;&#x5E8F;&#x5217; \(x_1, \cdots, x_n\) &#x7684;&#x79CD;&#x7C7B;&#x6570;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86; A, B &#x5403;&#x7684;&#x5BFF;&#x53F8;&#x7684;&#x5E8F;&#x5217; \(a_{u_i}\), \(b_{v_i}\)&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A; \(t\)&#xFF0C;&#x80AF;&#x5B9A;&#x6709; \(a_{u_t}\) &#x4E0D;&#x5728; \((b_1, b_2, \cdots, b_{v_t})\) &#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E; \(b_{v_i}\) &#x4E5F;&#x4E0D;&#x5728; \((a_1, a_2, \cdots, a_{u_t})\) &#x4E2D;&#xFF1B;&#x800C; \(x_t\) &#x53EA;&#x8981;&#x4E0D;&#x5728; \((a_1, a_2, \cdots, a_{u_t})\) &#x548C; \((b_1, b_2, \cdots, b_{v_t})\) &#x4E2D;&#x5C31;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7684; \(x_i\)&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684; \(t\) &#x53EF;&#x884C;&#x7684; \(x_t\) &#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x540E;&#x9762; A, B, C &#x5404;&#x81EA;&#x5403;&#x7684;&#x3002;&#x8BB0;&#x8FD9;&#x6837;&#x7684; \(x_t\) &#x53EF;&#x4EE5;&#x53D6;<br>\[f(u_t, v_t, t) = N - \left[3 (n - t) + \left|\left\{a_1, a_2, \cdots, a_{u_t}, b_1, b_2, \cdots, b_{v_t}\right\}\right|\right]\]<br>&#x6240;&#x4EE5;&#xFF0C;&#x5DF2;&#x6709; A, B &#x7684;&#x5BFF;&#x53F8;&#x5E8F;&#x5217;&#x65F6;&#xFF0C;\(x_i\) &#x7684;&#x5E8F;&#x5217;&#x6570;&#x662F; \(\prod_{t}{f(u_t, v_t, t)}\)&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7528; DP &#x6765;&#x8BA1;&#x7B97;&#x603B;&#x7684;&#x8FD9;&#x4E9B;&#x5408;&#x6CD5;&#x7684;&#x5E8F;&#x5217;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x8BBE; \({dp}_{i, j, k}\) &#x8868;&#x793A; \(u_k \le i\), \(v_k \le j\) &#x65F6;&#xFF0C;\(x_1, \cdots, x_k\) &#x7684;&#x603B;&#x5E8F;&#x5217;&#x6570;&#x76EE;&#x3002;&#x663E;&#x7136;&#x5C0F;&#x4E00;&#x70B9;&#x7684; \(i\) &#x548C; \(j\) &#x90FD;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x7B54;&#x6848;&#x91CC;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7B54;&#x6848;&#x81F3;&#x5C11;&#x6709; \({dp}_{i - 1, j, k} + {dp}_{i, j - 1, k} - {dp}_{i - 1, j - 1, k}\) &#x7684;&#x8D21;&#x732E;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x548C;&#xFF09;&#x3002;&#x5982;&#x679C; \(a_i\) &#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728; \((b_1, \cdots, b_j)\) &#x4E2D;&#xFF0C;&#x5E76;&#x4E14; \(b_j\) &#x4E5F;&#x6CA1;&#x51FA;&#x73B0;&#x5728; \((a_1, \cdots, a_i)\) &#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x8BA9; \(a_{u_k}=a_i\), \(b_{v_k}=b_j\)&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E00;&#x4E9B; \(x_1, x_2, \cdots, x_{k-1}\) &#x4E2D;&#x8F6C;&#x79FB;&#x8FC7;&#x6765;&#xFF0C;&#x5373;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x7B54;&#x6848;&#x8FD8;&#x6709; \(f(a_i, b_j, k) * {dp}_{i - 1, j - 1, k - 1}\) &#x7684;&#x8D21;&#x732E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x603B;&#x7684;&#xFF0C;\(x_t\) &#x7684;&#x5408;&#x6CD5;&#x5E8F;&#x5217;&#x6709;&#xFF1A;<br>\[{dp}_{i, j, k} = {dp}_{i - 1, j, k} + {dp}_{i, j - 1, k} - {dp}_{i - 1, j - 1, k} + \begin{cases}f(a_i, b_j, k) * {dp}_{i - 1, j - 1, k - 1}, &amp;, a_i, b_j \text{&#x5747;&#x7B2C;&#x4E00;&#x6B21;&#x51FA;&#x73B0;} \\ 0, &amp;,\text{else}\end{cases}\]</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x4ECE; \(x_t\) &#x5411; C &#x7684;&#x559C;&#x597D;&#x5E8F;&#x5217; \(c_i\) &#x8F6C;&#x79FB;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x548C;&#x5177;&#x4F53;&#x7684; \(a_i, b_i\) &#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x5047;&#x8BBE; \(p_{i,j}\) &#x4E3A;&#x5DF2;&#x77E5; \(x_t\)&#xFF0C;&#x4E14;&#x5DF2;&#x7ECF;&#x5403;&#x4E86; \(j\) &#x6B21;&#x3001;C &#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x559C;&#x597D;&#x5E8F;&#x5217;&#x7684;&#x524D; \(i\) &#x4E2A;&#x90FD;&#x88AB;&#x5403;&#x8FC7;&#x4E86;&#x7684;&#x60C5;&#x51B5;&#x7684; \(c_1, \cdots, c_i\) &#x79CD;&#x7C7B;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x5BFF;&#x53F8;&#x7F16;&#x53F7; \(c_i\)&#xFF0C;&#x5982;&#x679C; \(c_i\) &#x4E0D;&#x662F; \(x_t\) &#x4E2D;&#x7684;&#x5BFF;&#x53F8;&#xFF0C;&#x5219;&#x8FD9;&#x91CC;&#x53EA;&#x80FD;&#x53D6;&#x524D;&#x9762;&#x81EA;&#x5DF1;&#x6CA1;&#x5403;&#x8FC7;&#xFF0C;&#x4E14;&#x662F; A, B &#x524D; \(j\) &#x6B21;&#x5403;&#x8FC7;&#x7684;&#x5BFF;&#x53F8;&#xFF08;&#x4E0D;&#x7136; C &#x4F1A;&#x62A2;&#x5728; A, B &#x4E4B;&#x524D;&#x5403;&#x6389; \(c_i\)&#xFF0C;&#x90A3; \(c_i\) &#x5E94;&#x5F53;&#x5728; \(x_t\) &#x4E2D;&#xFF09;&#xFF1B;&#x5982;&#x679C; \(c_i\) &#x662F; \(x_t\) &#x4E2D;&#x7684;&#x5BFF;&#x53F8;&#xFF0C;&#x90A3;&#x8FD9;&#x4E00;&#x4F4D;&#x7F6E;&#x5C31;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x3002;&#x6240;&#x4EE5;&#xFF1A;<br>\[p_{i, j} = p_{i - 1, j} (3j - i) + p_{i - 1, j - 1}\]<br>&#x548C; \(a_i, b_i\) &#x751A;&#x81F3; \(x_t\) &#x7684;&#x5177;&#x4F53;&#x503C;&#x90FD;&#x65E0;&#x5173;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7B54;&#x6848;&#x662F; \({dp}_{N, N, n} * p_{N, n}\)&#xFF08;&#x67E5;&#x4E86;&#x8868;&#xFF0C;&#x5B9E;&#x9645; \(p_{N, n}\) &#x5C31;&#x662F; <a href="https://oeis.org/A052502" target="_blank" rel="noopener">A052502</a>&#xFF09;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6; \(\mathcal{O}{(N^3)}\)</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E7%AE%97%E6%B3%95/">#算法</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Atcoder/">#Atcoder</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2017/11/04/arc084/">AtCoder Regular Contest 084</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2017/10/19/cf876/">Codeforces Round #441 (Div. 2)</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    <!-- https://github.com/gitalk/gitalk/ -->


<div id="gitalk-container"></div>
<link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
<script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
<script>
	const gitalk = new Gitalk({
		clientID: 'f14a9588509f70e5daf3',
		clientSecret: 'b91f31763cfd5e1da04f45f23717b7564638c1fd',
		owner: 'ChieloNewctle',
		repo: 'chielonewctle.github.io',
		admin: [
		
			'ChieloNewctle',
		
		],
		id: '2017/10/22/atcoder-code-festival-2017-qualc/',
		distractionFreeMode: false // Facebook-like distraction free mode
	})

	gitalk.render('gitalk-container')
</script>


</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Chielo Newctle&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="RSS" href="/atom.xml">
                    
                    RSS
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Email" href="mailto:chielonewctle@yandex.com">
                    
                    Email
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Theme" href="https://github.com/ChieloNewctle/hexo-theme-minos" target="_blank" rel="noopener">
                    
                    Theme
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.loli.net/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.loli.net/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.loli.net/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.loli.net/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>
