<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Chielo&#39;s Blog</title>
  
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="https://chielonewctle.github.io/"/>
  <updated>2020-04-13T00:36:50.680Z</updated>
  <id>https://chielonewctle.github.io/</id>
  
  <author>
    <name>Chielo Newctle</name>
    
  </author>
  
  <generator uri="https://hexo.io/">Hexo</generator>
  
  <entry>
    <title>The 16th Zhejiang Provincial Collegiate Programming Contest</title>
    <link href="https://chielonewctle.github.io/2020/04/11/The-16th-Zhejiang-Provincial-Collegiate-Programming-Contest/"/>
    <id>https://chielonewctle.github.io/2020/04/11/The-16th-Zhejiang-Provincial-Collegiate-Programming-Contest/</id>
    <published>2020-04-11T16:00:00.000Z</published>
    <updated>2020-04-13T00:36:50.680Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><p>&#x961F;&#x4F0D;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E2A;&#x4EBA;&#x505A;&#x4E86; G, F, H, C, D&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x96BE;&#x5199;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x83DC;&#x2026;&#x2026;</p><a id="more"></a><div class="toc"><!-- toc --><ul><li><a href="#g-lucky-7-in-the-pocket">G - Lucky 7 in the Pocket</a></li><li><a href="#f-abbreviation">F - Abbreviation</a></li><li><a href="#h-singing-everywhere">H - Singing Everywhere</a></li><li><a href="#c-array-in-the-pocket">C - Array in the Pocket</a></li><li><a href="#d-traveler">D - Traveler</a></li></ul><!-- tocstop --></div><h2><span id="g-lucky-7-in-the-pocket">G - Lucky 7 in the Pocket</span><a href="#g-lucky-7-in-the-pocket" class="header-anchor">#</a></h2><p>&#x7B7E;&#x5230;&#x3002;</p><p><a href="/assets/src/vjudge/367735/g.py">&#x4EE3;&#x7801;</a></p><h2><span id="f-abbreviation">F - Abbreviation</span><a href="#f-abbreviation" class="header-anchor">#</a></h2><p>&#x7B7E;&#x5230;&#x3002;</p><p><a href="/assets/src/vjudge/367735/f.py">&#x4EE3;&#x7801;</a></p><h2><span id="h-singing-everywhere">H - Singing Everywhere</span><a href="#h-singing-everywhere" class="header-anchor">#</a></h2><p>&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x70B9;&#x53EA;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x4E24;&#x8FB9;&#x662F;&#x5426;&#x662F; &#x201C;voice crack&#x201D;&#xFF0C;&#x56E0;&#x6B64;&#x5B58;&#x4E00;&#x4E0B;&#x524D;&#x7F00;&#x548C;&#x540E;&#x7F00;&#x7684; &#x201C;voice crack&#x201D; &#x7684;&#x6570;&#x91CF;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4E24;&#x8FB9;&#x7684;&#x60C5;&#x51B5;&#x5373;&#x53EF;&#x3002;</p><p><a href="/assets/src/vjudge/367735/h.cpp">&#x4EE3;&#x7801;</a></p><h2><span id="c-array-in-the-pocket">C - Array in the Pocket</span><a href="#c-array-in-the-pocket" class="header-anchor">#</a></h2><p>&#x5982;&#x679C;&#x6700;&#x591A;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6570;&#x91CF;&#x662F;&#x8D85;&#x8FC7;&#x4E00;&#x534A;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x6EE1;&#x8DB3;&#x91CD;&#x65B0;&#x6392;&#x5217;&#x540E;&#x6EE1;&#x8DB3;&#x9898;&#x76EE;&#x7684;&#x6761;&#x4EF6;&#x3002;</p><p>&#x8FDB;&#x4E00;&#x6B65;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x653E;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#x4E0D;&#x4E3A;&#x539F;&#x5E8F;&#x5217; $A$&#xFF0C;&#x800C;&#x662F;&#x53E6;&#x5916;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x548C;&#x539F;&#x5E8F;&#x5217;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#x7684;&#x591A;&#x91CD;&#x96C6; $S$&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x6709;&#x5F53;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5728; $A$ &#x548C; $S$ &#x51FA;&#x73B0;&#x7684;&#x603B;&#x6570;&#x4E0D;&#x8D85;&#x8FC7; $|A|$&#xFF0C;&#x624D;&#x4F1A;&#x6709;&#x89E3;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5143;&#x7D20;&#x51FA;&#x73B0;&#x7684;&#x603B;&#x6570;&#x4E3A; $|A|$&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x5143;&#x7D20;&#x91CD;&#x6392;&#x7684;&#x4F4D;&#x7F6E;&#x662F;&#x786E;&#x5B9A;&#x7684;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#xFF0C;&#x5927;&#x601D;&#x8DEF;&#x786E;&#x5B9E;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x653E;&#x5C0F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x653E;&#x66F4;&#x52A3;&#x7684;&#x503C;&#x3002;</p><p>&#x5047;&#x8BBE;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x653E;&#x597D;&#x4E86; $i - 1$ &#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x8FD8;&#x5269;&#x4E0B;&#x6CA1;&#x6709;&#x653E;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#x7684;&#x591A;&#x91CD;&#x96C6;&#x4E3A; $S$&#xFF1A;</p><ul><li>&#x82E5; $a[i:n]$ &#x548C; $S$ &#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x603B;&#x6570;&#x6700;&#x591A;&#x7684;&#x5143;&#x7D20; $v$&#xFF0C;&#x6570;&#x91CF;&#x82E5;&#x4E3A; $n - i + 1$&#xFF08;&#x5373;&#x8BF4;&#x660E; $v$ &#x80FD;&#x653E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F53;&#x524D;&#x60C5;&#x51B5;&#x5DF2;&#x7ECF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x4E86;&#xFF09;&#xFF0C;&#x5F53; $a_i \ne v$ &#x65F6;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x4E0D;&#x653E;&#x7F6E; $v$ &#x5728;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x3002;</li><li>&#x82E5; $a_i \ne \min{S}$&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x653E; $\min{S}$&#x3002;</li><li>&#x82E5; $a_i = \min{S}$&#xFF0C;&#x90A3;&#x5C31;&#x653E;&#x6B21;&#x5C0F;&#x7684;&#x3002;</li></ul><p><a href="/assets/src/vjudge/367735/c.cpp">&#x4EE3;&#x7801;</a>&#xFF1A;&#x5199;&#x6B8B;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x7684;&#x66F4;&#x4F18;&#x96C5;&#x4E00;&#x70B9;&#x3002;</p><h2><span id="d-traveler">D - Traveler</span><a href="#d-traveler" class="header-anchor">#</a></h2><p>&#x540E;&#x671F;&#x5C31;&#x5269;&#x4E0B; D &#x548C; A &#x5728;&#x5199;&#xFF0C;D &#x6211;&#x6709;&#x4E2A;&#x548C;&#x961F;&#x53CB;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x5077;&#x5077;&#x5199;&#x4E86;&#x4E00;&#x4E0B;&#x3002;</p><p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4ECE;&#x6839;&#x8282;&#x70B9;&#x8D70;&#x5230;&#x8282;&#x70B9; $n$&#xFF0C;&#x8D70;&#x8FC7;&#x8FD9;&#x6761;&#x6811;&#x94FE;&#x540E;&#xFF0C;&#x5269;&#x4E0B;&#x672A;&#x8D70;&#x8FC7;&#x7684;&#x70B9;&#x5F62;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x5B8C;&#x5168;&#x3001;&#x6EE1;&#x4E8C;&#x53C9;&#x5B50;&#x6811;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x901A;&#x8FC7; $i - 1$ &#x7684;&#x8FB9;&#x8D70;&#x5230;&#x76F8;&#x90BB;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4ECE;&#x4E00;&#x4E2A;&#x5B50;&#x6811;&#x7684;&#x6700;&#x53F3;&#x7AEF;&#x8D70;&#x5230;&#x6700;&#x5DE6;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x91CD;&#x590D;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x76F4;&#x5230; $i - 1$ &#x8D70;&#x5230; $n$ &#x6240;&#x5728;&#x7684;&#x6811;&#x94FE;&#x4E3A;&#x6B62;&#x3002;</p><p>&#x4F60;&#x4F1A;&#x60F3;&#x8BF4;&#x8D70;&#x5230;&#x6574;&#x68F5;&#x6811;&#x7684;&#x6700;&#x5DE6;&#x7AEF;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x540E;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x3002;&#x4F1A;&#x53D1;&#x73B0;&#x901A;&#x8FC7; $i - 1$ &#x7684;&#x8FB9;&#x53EF;&#x4EE5;&#x8D70;&#x5230;&#x6574;&#x68F5;&#x6811;&#x6D45;&#x4E00;&#x5C42;&#x7684;&#x6700;&#x53F3;&#x7AEF;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5269;&#x4E0B;&#x8FD8;&#x6CA1;&#x6709;&#x8D70;&#x8FC7;&#x7684;&#x70B9;&#x5F62;&#x6210;&#x5728;&#x6700;&#x53F3;&#x4FA7;&#x5B50;&#x6811;&#x7684;&#x6700;&#x53F3;&#x7AEF;&#x3002;</p><p>&#x5B9E;&#x73B0;&#x4ECE;&#x5B50;&#x6811;&#x7684;&#x6700;&#x53F3;&#x8D70;&#x5230;&#x6700;&#x5DE6;&#x64CD;&#x4F5C;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E0B;&#x4ECE;&#x6700;&#x53F3;&#x8D70;&#x5230;&#x6839;&#x3001;&#x4ECE;&#x6839;&#x8D70;&#x5230;&#x6700;&#x5DE6;&#x3002;&#x7136;&#x540E;&#x8FD9;&#x4E09;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x9012;&#x5F52;&#x4E00;&#x4E0B;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x5B50;&#x6811;&#x7684;&#x904D;&#x5386;&#x3002;</p><p><a href="/assets/src/vjudge/367735/d.cpp">&#x4EE3;&#x7801;</a>&#xFF1A;&#x5199;&#x6B8B;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x7684;&#x66F4;&#x4F18;&#x96C5;&#x4E00;&#x70B9;&#x3002;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;p&gt;&amp;#x961F;&amp;#x4F0D;&amp;#x8BAD;&amp;#x7EC3;&amp;#xFF0C;&amp;#x4E2A;&amp;#x4EBA;&amp;#x505A;&amp;#x4E86; G, F, H, C, D&amp;#xFF0C;&amp;#x90FD;&amp;#x662F;&amp;#x4E0D;&amp;#x96BE;&amp;#x5199;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD8;&amp;#x662F;&amp;#x83DC;&amp;#x2026;&amp;#x2026;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="训练记录" scheme="https://chielonewctle.github.io/categories/%E8%AE%AD%E7%BB%83%E8%AE%B0%E5%BD%95/"/>
    
    
      <category term="算法" scheme="https://chielonewctle.github.io/tags/%E7%AE%97%E6%B3%95/"/>
    
      <category term="训练" scheme="https://chielonewctle.github.io/tags/%E8%AE%AD%E7%BB%83/"/>
    
  </entry>
  
  <entry>
    <title>Chess Puzzle - ICPC 长春区域赛 2015</title>
    <link href="https://chielonewctle.github.io/2019/09/08/changchun-regional-2015-chess-puzzle/"/>
    <id>https://chielonewctle.github.io/2019/09/08/changchun-regional-2015-chess-puzzle/</id>
    <published>2019-09-08T16:00:00.000Z</published>
    <updated>2020-04-13T00:36:50.680Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><h2><span id="ti-yi">&#x9898;&#x610F;</span><a href="#ti-yi" class="header-anchor">#</a></h2><p>&#x7ED9;&#x4E00;&#x4E2A; $n \times m$ &#x7684;&#x68CB;&#x76D8;&#xFF0C;&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x6709;&#x7A7A;&#x3001;&#x9ED1;&#x3001;&#x767D;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x3002;<!---->&#x73B0;&#x5728;&#x9700;&#x8981;&#x586B;&#x5145;&#x7A7A;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F7F;&#x5F97;&#x989C;&#x8272;&#x4E0D;&#x540C;&#x7684;&#x3001;&#x884C;&#x5750;&#x6807;&#x5DEE;&#x4E3A; $a$&#x3001;&#x5217;&#x5750;&#x6807;&#x5DEE;&#x4E3A; $b$ &#x7684;&#x68CB;&#x5B50;&#x5BF9;&#x6570;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x3002;<!---->&#x4F46;&#x8981;&#x7ED9;&#x51FA;&#x5B57;&#x5178;&#x5E8F;&#x6700;&#x5C0F;&#x7684;&#x89E3;&#x3002;</p><a id="more"></a><h2><span id="ti-jie">&#x9898;&#x89E3;</span><a href="#ti-jie" class="header-anchor">#</a></h2><p>&#x5982;&#x679C;&#x662F;&#x6570;&#x989C;&#x8272;&#x76F8;&#x540C;&#xFF0C;&#x4E5F;&#x4E0D;&#x7ED9;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x7B80;&#x5355;&#x7684;&#x591A;&#x3002;<!---->&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x7F51;&#x7EDC;&#x6D41;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#x3002;<!---->&#x5982;&#x679C;&#x548C; S &#x5212;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x653E;&#x9ED1;&#x68CB;&#x5B50;&#xFF0C;&#x548C;&#x6C47;&#x70B9;&#x5212;&#x4E00;&#x8D77;&#x5219;&#x653E;&#x767D;&#x68CB;&#x5B50;&#x3002;<!---->&#x5750;&#x6807;&#x8DDD;&#x79BB;&#x6EE1;&#x8DB3;&#x9650;&#x5236;&#x7684;&#x4E24;&#x4E2A;&#x70B9;&#x4E92;&#x76F8;&#x8FDE;&#x4E00;&#x4E2A;&#x5BB9;&#x91CF;&#x4E3A; 1 &#x7684;&#x8FB9;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#x989C;&#x8272;&#x4E0D;&#x540C;&#x5219;&#x4F1A;&#x5272;&#x5230;&#x8FD9;&#x6761;&#x8FB9;&#x3002;</p><p>&#x4F46;&#x73B0;&#x5728;&#x662F;&#x989C;&#x8272;&#x4E0D;&#x540C;&#xFF0C;&#x9700;&#x8981;&#x6362;&#x4E00;&#x4E0B;&#x610F;&#x4E49;&#x3002;</p><p>&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#x6EE1;&#x8DB3;&#x5750;&#x6807;&#x8DDD;&#x79BB;&#x9650;&#x5236;&#x7684;&#x70B9;&#x53EF;&#x4EE5;&#x9ED1;&#x767D;&#x67D3;&#x8272;&#xFF08;&#x4E0B;&#x6587;&#x6539;&#x79F0;&#x7EA2;&#x84DD;&#xFF09;&#xFF0C;<!---->&#x6BCF; $a$ &#x884C;&#x4E00;&#x7EC4;&#xFF0C;&#x7EA2;&#x84DD;&#x4EA4;&#x66FF;&#x67D3;&#x8272;&#xFF08;&#x524D; $a$ &#x884C;&#x67D3;&#x7EA2;&#xFF0C;&#x63A5;&#x4E0B;&#x6765; $a$ &#x884C;&#x67D3;&#x84DD;&#x2026;&#x2026;&#xFF09;&#x3002;</p><p>&#x7EA2;&#x70B9;&#x82E5;&#x548C; S &#x5212;&#x4E00;&#x8D77;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x653E;&#x9ED1;&#x7684;&#xFF1B;&#x84DD;&#x70B9;&#x82E5;&#x548C; S &#x5212;&#x4E00;&#x8D77;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x653E;&#x767D;&#x7684;&#xFF1B;&#x53CD;&#x8FC7;&#x6765;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x7EA2; T &#x67D3;&#x767D;&#xFF0C;&#x84DD; T &#x67D3;&#x9ED1;&#x3002;</p><p>&#x8FD9;&#x6837;&#x8FDE;&#x8FB9;&#x548C;&#x4E0A;&#x9762;&#x989C;&#x8272;&#x76F8;&#x540C;&#x65F6;&#x5019;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8DDD;&#x79BB;&#x6EE1;&#x8DB3;&#x9650;&#x5236;&#x7684;&#x4E92;&#x76F8;&#x8FDE;&#x5BB9;&#x91CF;&#x4E3A; 1 &#x7684;&#x8FB9;&#xFF0C;&#x8FD9;&#x6837;&#x8FDE;&#x63A5;&#x7684;&#x80AF;&#x5B9A;&#x5206;&#x522B;&#x662F;&#x7EA2;&#x84DD;&#x4E24;&#x70B9;&#x3002;</p><p>&#x5F3A;&#x5236;&#x8BA9;&#x67D0;&#x4E2A;&#x70B9;&#x4E3A;&#x9ED1;&#x6216;&#x767D;&#x68CB;&#x5B50;&#xFF0C;&#x5219;&#x6309;&#x4E0A;&#x9762;&#x7684;&#x7EA2;&#x84DD;&#x70B9;&#x548C;&#x6E90;&#x6C47;&#x7684;&#x5173;&#x7CFB;&#x8FDE;&#x4E00;&#x4E2A;&#x65E0;&#x7A77;&#x5927;&#x7684;&#x8FB9;&#x5373;&#x53EF;&#x3002;</p><p>&#x7B54;&#x6848;&#x5373;&#x4E3A;&#x8DDD;&#x79BB;&#x6EE1;&#x8DB3;&#x9650;&#x5236;&#x7684;&#x70B9;&#x5BF9;&#x6570;&#x91CF;&#xFF0C;&#x51CF; S-T &#x6700;&#x5C0F;&#x5272;&#x7684;&#x503C;&#x3002;</p><h3><span id="fang-an">&#x65B9;&#x6848;</span><a href="#fang-an" class="header-anchor">#</a></h3><p>&#x65B9;&#x6848;&#x662F;&#x4E2A;&#x9EBB;&#x70E6;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x8981;&#x5B57;&#x5178;&#x5E8F;&#x6700;&#x5C0F;&#x3002;</p><p>&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x3001;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF0C;&#x8D2A;&#x5FC3;&#x770B;&#x8FD9;&#x4E2A;&#x70B9;&#x80FD;&#x4E0D;&#x80FD;&#x67D3;&#x9ED1;&#x7684;&#x3002;</p><p>&#x5728;&#x6B8B;&#x4F59;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x4ECE;&#x6E90;&#x70B9;&#x51FA;&#x53D1;&#x67D3;&#x8272;&#x3001;&#x4ECE;&#x6C47;&#x70B9;&#x51FA;&#x53D1;&#x53CD;&#x5411;&#x67D3;&#x8272;&#xFF0C;<!---->&#x82E5;&#x8FD9;&#x4E2A;&#x70B9;&#x5728;&#x6B8B;&#x4F59;&#x7F51;&#x7EDC;&#x4E0A;&#x548C;&#x6E90;&#x70B9;&#x76F8;&#x8FDE;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x5FC5;&#x7136;&#x628A;&#x5B83;&#x548C; S &#x5272;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF1B;&#x53CD;&#x4E4B;&#x548C; T &#x5272;&#x5728;&#x4E00;&#x8D77;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x67D3;&#x5230;&#x7684;&#x70B9;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x70B9;&#x53EF;&#x4EE5;&#x662F;&#x9ED1;&#x7684;&#x3002;<!---->&#x6B64;&#x65F6;&#x5DF2;&#x77E5;&#x8BE5;&#x70B9;&#x4E3A;&#x9ED1;&#x8272;&#x7684;&#xFF0C;&#x6F5C;&#x5728;&#x5730;&#x9700;&#x8981;&#x518D;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x6240;&#x8BF4;&#x7684;&#x548C;&#x6E90;&#x6216;&#x6C47;&#x8FDE;&#x8FB9;&#xFF0C;&#x8DD1;&#x7F51;&#x7EDC;&#x6D41;&#xFF0C;&#x5E76;&#x518D;&#x8FDB;&#x884C;&#x67D3;&#x8272;&#x3002;<!---->&#x4F46;&#x8FD9;&#x4E0D;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x7B54;&#x6848;&#x5DF2;&#x7ECF;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5047;&#x88C5;&#x8FD9;&#x4E2A;&#x70B9;&#x548C;&#x6E90;&#x6216;&#x6C47;&#x6709;&#x8FB9;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x67D3;&#x8272;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x518D;&#x67D3;&#x8272;&#x3002;</p><p>&#x7C7B;&#x4F3C;&#x4E8E;&#x5DF2;&#x77E5;&#x67D0;&#x4E2A;&#x70B9;&#x662F;&#x9ED1;&#x68CB;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x5DF2;&#x77E5;&#x60C5;&#x51B5;&#x53BB;&#x9012;&#x5F52;&#x653E;&#x7A7A;&#x4F4D;&#x7F6E;&#x7684;&#x9ED1;&#x767D;&#x68CB;&#x5B50;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x540E;&#x7EED;&#x9519;&#x653E;&#x6210;&#x9ED1;&#x7684;&#x3002;</p><h2><span id="dai-ma">&#x4EE3;&#x7801;</span><a href="#dai-ma" class="header-anchor">#</a></h2><p><a href="/assets/src/uvalive/7191/i.cpp">UVALive 7191 - ISAP</a></p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;h2 id=&quot;&amp;#x9898;&amp;#x610F;&quot;&gt;&lt;a href=&quot;#&amp;#x9898;&amp;#x610F;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x9898;&amp;#x610F;&quot;&gt;&lt;/a&gt;&amp;#x9898;&amp;#x610F;&lt;/h2&gt;&lt;p&gt;&amp;#x7ED9;&amp;#x4E00;&amp;#x4E2A; $n \times m$ &amp;#x7684;&amp;#x68CB;&amp;#x76D8;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4F4D;&amp;#x7F6E;&amp;#x6709;&amp;#x7A7A;&amp;#x3001;&amp;#x9ED1;&amp;#x3001;&amp;#x767D;&amp;#x4E09;&amp;#x79CD;&amp;#x60C5;&amp;#x51B5;&amp;#x3002;&lt;!--
--&gt;&amp;#x73B0;&amp;#x5728;&amp;#x9700;&amp;#x8981;&amp;#x586B;&amp;#x5145;&amp;#x7A7A;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C;&amp;#x4F7F;&amp;#x5F97;&amp;#x989C;&amp;#x8272;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x3001;&amp;#x884C;&amp;#x5750;&amp;#x6807;&amp;#x5DEE;&amp;#x4E3A; $a$&amp;#x3001;&amp;#x5217;&amp;#x5750;&amp;#x6807;&amp;#x5DEE;&amp;#x4E3A; $b$ &amp;#x7684;&amp;#x68CB;&amp;#x5B50;&amp;#x5BF9;&amp;#x6570;&amp;#x5C3D;&amp;#x53EF;&amp;#x80FD;&amp;#x591A;&amp;#x3002;&lt;!--
--&gt;&amp;#x4F46;&amp;#x8981;&amp;#x7ED9;&amp;#x51FA;&amp;#x5B57;&amp;#x5178;&amp;#x5E8F;&amp;#x6700;&amp;#x5C0F;&amp;#x7684;&amp;#x89E3;&amp;#x3002;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="题解" scheme="https://chielonewctle.github.io/categories/%E9%A2%98%E8%A7%A3/"/>
    
    
      <category term="ICPC" scheme="https://chielonewctle.github.io/tags/ICPC/"/>
    
      <category term="区域赛" scheme="https://chielonewctle.github.io/tags/%E5%8C%BA%E5%9F%9F%E8%B5%9B/"/>
    
      <category term="网络流" scheme="https://chielonewctle.github.io/tags/%E7%BD%91%E7%BB%9C%E6%B5%81/"/>
    
      <category term="最大流" scheme="https://chielonewctle.github.io/tags/%E6%9C%80%E5%A4%A7%E6%B5%81/"/>
    
      <category term="最小割" scheme="https://chielonewctle.github.io/tags/%E6%9C%80%E5%B0%8F%E5%89%B2/"/>
    
  </entry>
  
  <entry>
    <title>Codeforces Round #556 (Div. 1)</title>
    <link href="https://chielonewctle.github.io/2019/04/29/Codeforces-Round-556-Div-1/"/>
    <id>https://chielonewctle.github.io/2019/04/29/Codeforces-Round-556-Div-1/</id>
    <published>2019-04-29T16:00:00.000Z</published>
    <updated>2020-04-13T00:36:50.680Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><table><thead><tr><th>&#x9898;&#x76EE;</th><th>A</th><th>B</th><th>C</th><th>D</th><th>E</th></tr></thead><tbody><tr><td>&#x72B6;&#x51B5;</td><td>AC+0</td><td>AC+1</td><td>&#x5DF2;&#x8865;</td><td>&#x5F85;&#x8865;</td><td>&#x6CA1;&#x770B;</td></tr></tbody></table><p>&#x6DA8;&#x5206;&#x4E86;&#xFF0C;&#x7EC8;&#x4E8E;&#x6709;&#x70B9;&#x6A59;&#x6C41;&#x7684;&#x989C;&#x8272;&#x4E86;&#x3002;&#xFF08;&#x6211;&#x597D;&#x83DC;&#x5440;&#xFF09;</p><a id="more"></a><div class="toc"><!-- toc --><ul><li><a href="#a-prefix-sum-primes">A. Prefix Sum Primes</a></li><li><a href="#b-three-religions">B. Three Religions</a></li><li><a href="#c-tree-generator-tm">C. Tree Generator&#x2122;</a></li><li><a href="#d-abandoning-roads">D. Abandoning Roads</a></li><li><a href="#e-election-promises">E. Election Promises</a></li></ul><!-- tocstop --></div><h3><span id="a-prefix-sum-primes">A. Prefix Sum Primes</span><a href="#a-prefix-sum-primes" class="header-anchor">#</a></h3><h4><span id="ti-yi">&#x9898;&#x610F;</span><a href="#ti-yi" class="header-anchor">#</a></h4><p>\(a\) &#x4E2A; 1&#xFF0C;\(b\) &#x4E2A; 2&#xFF0C;&#x7528;&#x8FD9;&#x4E9B;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x6570;&#x5217; \(\{a_i\}\)&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x7684;&#x524D;&#x7F00;&#x548C; \(\{S_i\}\) &#x51FA;&#x73B0;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x8D28;&#x6570;&#x3002;</p><h4><span id="ti-jie">&#x9898;&#x89E3;</span><a href="#ti-jie" class="header-anchor">#</a></h4><p>&#x8D28;&#x6570;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x8BA9;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; \(a + 2b\) &#x7684;&#x5168;&#x90E8;&#x51FA;&#x73B0;&#x4E00;&#x904D;&#xFF1B;<!---->\(a = 0\) &#x6216;&#x8005; \(b = 0\) &#x5C31;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x5C31;&#x597D;&#xFF0C;\(a = 0\) &#x65F6;&#x6700;&#x591A;&#x80FD;&#x51FA;&#x73B0;&#x4E2A;&#x8D28;&#x6570; \(2\)&#xFF1B;<!---->&#x5982;&#x679C;&#x80FD;&#x6709;&#x4E00;&#x4E2A; 1 &#x548C;&#x4E00;&#x4E2A; 2&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x5148;&#x653E;&#x4E0B;&#x4E00;&#x4E2A; 2&#xFF0C;&#x518D;&#x653E;&#x4E0B;&#x4E00;&#x4E2A; 1&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x628A;&#x5269;&#x4E0B;&#x7684; 2 &#x5168;&#x90E8;&#x653E;&#x4E0B;&#xFF0C;&#x6700;&#x540E;&#x653E;&#x4E0B;&#x5269;&#x4E0B;&#x7684; 1&#xFF0C;<!---->&#x8FD9;&#x6837;&#x505A;&#x662F;&#x56E0;&#x4E3A;&#x5076;&#x8D28;&#x6570;&#x53EA;&#x6709;&#x4E2A; 2&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x6784;&#x9020;&#x51FA;&#x6765;&#x6240;&#x6709;&#x7684;&#x5947;&#x6570;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; \(a + 2b\) &#x7684;&#x5168;&#x90E8;&#x51FA;&#x73B0;&#x4E00;&#x904D;&#x4E86;&#x3002;</p><h3><span id="b-three-religions">B. Three Religions</span><a href="#b-three-religions" class="header-anchor">#</a></h3><blockquote><p>RE &#x4E00;&#x53D1;&#xFF0C;&#x4EA4;&#x9898;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#xFF0C;&#x72B6;&#x6001;&#x538B;&#x6210;&#x6574;&#x6570;&#x65F6;&#x8D8A;&#x754C;&#x4E86;</p></blockquote><h4><span id="ti-yi">&#x9898;&#x610F;</span><a href="#ti-yi" class="header-anchor">#</a></h4><p>&#x7ED9;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A; \(n \le {10}^5\) &#x7684;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x4E32; \(S\)&#xFF0C;&#x7136;&#x540E;&#x6709; 3 &#x4E2A;&#x957F;&#x5EA6;&#x4E0D;&#x8D85;&#x8FC7; \(250\) &#x521D;&#x59CB;&#x4E3A;&#x7A7A;&#x7684;&#x5C0F;&#x5B57;&#x7B26;&#x4E32; \(t_{i}\)&#x3002;<!---->&#x6709; \(q\) &#x6B21;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x5728;&#x67D0;&#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x540E;&#x9762;&#x52A0;&#x4E00;&#x4E2A;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x8981;&#x4E48;&#x5220;&#x6389;&#x67D0;&#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x6700;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x3002;<!---->&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x56DE;&#x7B54;&#x53EF;&#x5426;&#x4ECE; \(S\) &#x62BD;&#x53D6; 3 &#x4E2A;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;&#x5B50;&#x5E8F;&#x5217;&#xFF0C;&#x548C; 3 &#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x76F8;&#x540C;&#x3002;</p><p><img src="https://codeforces.com/predownloaded/0b/98/0b98944fc9123a2217b01d04058c297699525ea6.png" alt="&#x6837;&#x4F8B;&#x56FE;"></p><h4><span id="ti-jie">&#x9898;&#x89E3;</span><a href="#ti-jie" class="header-anchor">#</a></h4><p>&#x5047;&#x8BBE; 3 &#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x53D8;&#xFF0C;&#x53EF;&#x4EE5;&#x6709; \({dp}_{i, j, k}\)&#xFF0C;&#x610F;&#x4E49;&#x662F;&#x4ECE; \(S\) &#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x5730;&#x5212;&#x5206; 3 &#x4E2A;&#x5B50;&#x5E8F;&#x5217;&#xFF0C;&#x6784;&#x6210;&#x4E86; 3 &#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#x5404;&#x81EA;&#x7684;&#x524D; \(i, j, k\) &#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x5C11;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230; \(S\) &#x7684;&#x524D; \({dp}_{i, j, k}\) &#x4E2A;&#x5B57;&#x7B26;&#x3002;</p><p>&#x6709; \({dp}_{0, 0, 0} = 0\)&#xFF0C;&#x8BB0; \({nearest}(i, c)\) &#x4E3A; \(S\) &#x4ECE;&#x7B2C; \(i\) &#x4E2A;&#x5B57;&#x7B26;&#x627E;&#xFF0C;&#x5B57;&#x7B26; \(c\) &#x7B2C;&#x4E00;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#x4F4D;&#x7F6E;&#x3002;<!---->&#x5219;&#xFF1A;<br>\[{dp}_{i, j, k} = \min\begin{cases}<br>{nearest}({dp}_{i - 1, j, k} + 1, t_{0, i}), &amp; i &gt; 0; \\<br>{nearest}({dp}_{i, j - 1, k} + 1, t_{1, j}), &amp; j &gt; 0; \\<br>{nearest}({dp}_{i, j, k - 1} + 1, t_{2, k}), &amp; k &gt; 0.<br>\end{cases}\]</p><p>\(nearest\) &#x53EF;&#x4EE5; \(\mathcal{O}(n \Sigma)\) &#x65F6;&#x95F4;&#x5185;&#x9884;&#x5904;&#x7406;&#x51FA;&#x6765;&#xFF0C;\(dp\) &#x8F6C;&#x79FB; \(\mathcal{O}(1)\)</p><p>&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A; \(dp\)&#xFF0C;&#x5728;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x5C0F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6BD4;&#x5982; \(t_0\) &#x672B;&#x5C3E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5BF9;&#x5404;&#x79CD; \(j, k\) &#x7B97; \({dp}(|t_0|, j, k)\) &#x5373;&#x53EF;&#x3002;</p><p>&#x6240;&#x4EE5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5927;&#x6982;&#x662F; \(\mathcal{O}(n \Sigma + q \cdot 250 \cdot 250)\)&#x3002;</p><h3><span id="c-tree-generator-tm">C. Tree Generator&#x2122;</span><a href="#c-tree-generator-tm" class="header-anchor">#</a></h3><p>&#x6BD4;&#x8D5B;&#x65F6;&#x5B9E;&#x9645;&#x60F3;&#x5230;&#x3001;&#x4E5F;&#x67E5;&#x5230;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;DFS&#x5E8F;&#x7C7B;&#x4F3C;&#x7684;&#x52A8;&#x6001;&#x7EF4;&#x62A4;&#x6811;&#x7684;&#x6DF1;&#x5EA6;&#x7B49;&#x4FE1;&#x606F;&#x3002;<!---->&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x7EF4;&#x62A4;&#x76F4;&#x5F84;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x6709;&#x70B9;&#x83DC;&#xFF09;&#x3002;&#x8865;&#x4E00;&#x4E0B;&#x3002;</p><h3><span id="d-abandoning-roads">D. Abandoning Roads</span><a href="#d-abandoning-roads" class="header-anchor">#</a></h3><p><em>&#x5F85;&#x8865;</em></p><h3><span id="e-election-promises">E. Election Promises</span><a href="#e-election-promises" class="header-anchor">#</a></h3><p><em>&#x5F85;&#x8865;</em></p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;table&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;th&gt;&amp;#x9898;&amp;#x76EE;&lt;/th&gt;
&lt;th&gt;A&lt;/th&gt;
&lt;th&gt;B&lt;/th&gt;
&lt;th&gt;C&lt;/th&gt;
&lt;th&gt;D&lt;/th&gt;
&lt;th&gt;E&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;&lt;tr&gt;
&lt;td&gt;&amp;#x72B6;&amp;#x51B5;&lt;/td&gt;
&lt;td&gt;AC+0&lt;/td&gt;
&lt;td&gt;AC+1&lt;/td&gt;
&lt;td&gt;&amp;#x5DF2;&amp;#x8865;&lt;/td&gt;
&lt;td&gt;&amp;#x5F85;&amp;#x8865;&lt;/td&gt;
&lt;td&gt;&amp;#x6CA1;&amp;#x770B;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;&lt;/table&gt;
&lt;p&gt;&amp;#x6DA8;&amp;#x5206;&amp;#x4E86;&amp;#xFF0C;&amp;#x7EC8;&amp;#x4E8E;&amp;#x6709;&amp;#x70B9;&amp;#x6A59;&amp;#x6C41;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x4E86;&amp;#x3002;&amp;#xFF08;&amp;#x6211;&amp;#x597D;&amp;#x83DC;&amp;#x5440;&amp;#xFF09;&lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="比赛记录" scheme="https://chielonewctle.github.io/categories/%E6%AF%94%E8%B5%9B%E8%AE%B0%E5%BD%95/"/>
    
    
      <category term="算法" scheme="https://chielonewctle.github.io/tags/%E7%AE%97%E6%B3%95/"/>
    
      <category term="数学" scheme="https://chielonewctle.github.io/tags/%E6%95%B0%E5%AD%A6/"/>
    
      <category term="DP" scheme="https://chielonewctle.github.io/tags/DP/"/>
    
  </entry>
  
  <entry>
    <title>北航春训 DOMjudge 配置坑点</title>
    <link href="https://chielonewctle.github.io/2019/04/27/DOMjudge-buaa-spring/"/>
    <id>https://chielonewctle.github.io/2019/04/27/DOMjudge-buaa-spring/</id>
    <published>2019-04-27T16:00:00.000Z</published>
    <updated>2020-04-13T00:36:50.680Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><blockquote><p>DOMjudge &#x7248;&#x672C;&#xFF1A;6.0.3</p></blockquote><a id="more"></a><p>&#x603B;&#x4F53;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x6309;&#x7167;&#x5B98;&#x65B9;&#x7684;<!----> <a href="https://www.domjudge.org/docs/admin-manual.html" target="_blank" rel="noopener">admin manual</a> <!---->&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x4E0D;&#x4F1A;&#x51FA;&#x9519;&#x7684;&#x3002;<!---->&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x67E5;&#x624B;&#x518C;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x67E5; <a href="https://www.domjudge.org/pipermail/domjudge-devel/" target="_blank" rel="noopener">maillist</a>&#x3002;</p><p>&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x6700;&#x65B0;&#x7684;&#xFF08;18.10&#xFF09; Ubuntu Server&#x3002;</p><h2><span id="ce-shi-yong-ti-mu-bao">&#x6D4B;&#x8BD5;&#x7528;&#x9898;&#x76EE;&#x5305;</span><a href="#ce-shi-yong-ti-mu-bao" class="header-anchor">#</a></h2><p><a href="https://github.com/ChieloNewctle/domjudge-contest-sample" target="_blank" rel="noopener">ChieloNewctle/domjudge-contest-sample</a></p><h2><span id="domserver">domserver</span><a href="#domserver" class="header-anchor">#</a></h2><h3><span id="bu-shu">&#x90E8;&#x7F72;</span><a href="#bu-shu" class="header-anchor">#</a></h3><p>&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x8BF4;&#x7684;&#xFF0C;&#x6309;&#x5B98;&#x65B9;&#x8BF4;&#x660E;&#x7684;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x8D70;&#x5373;&#x53EF;&#x3002;</p><p>&#x65B0;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x5728; Jury interface &#x63D0;&#x4F9B;&#x4E86; Config Checker&#xFF0C;<!---->&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x5F88;&#x591A;&#x914D;&#x7F6E;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x90E8;&#x5206;&#x7684; Finetune &#x53C2;&#x6570;&#x3002;</p><h3><span id="shu-ju-dao-ru-dao-chu">&#x6570;&#x636E;&#x5BFC;&#x5165;&#x5BFC;&#x51FA;</span><a href="#shu-ju-dao-ru-dao-chu" class="header-anchor">#</a></h3><p>&#x6E90;&#x7801;&#x5728; <code>domserver/lib/lib.impexp.php</code> &#x4E2D;&#x3002;</p><h4><span id="dao-ru-teams-tsv">&#x5BFC;&#x5165; <code>teams.tsv</code></span><a href="#dao-ru-teams-tsv" class="header-anchor">#</a></h4><p>&#x5148;&#x5BFC;&#x5165; <code>teams.tsv</code> &#x518D;&#x5BFC;&#x5165; <code>accounts.tsv</code></p><h5><span id="teams-tsv-ge-shi"><code>teams.tsv</code> &#x683C;&#x5F0F;</span><a href="#teams-tsv-ge-shi" class="header-anchor">#</a></h5><p></p><figure class="highlight livescript hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">File_Version    <span class="hljs-number">1</span></span><br><span class="line">&#x552F;&#x4E00;&#x7684;&#x961F;&#x4F0D;ID<span class="hljs-string">\t</span>&#x552F;&#x4E00;&#x7684;&#x5916;&#x90E8;ID<span class="hljs-string">\t</span>team_category&#x7684;ID<span class="hljs-string">\t</span>&#x961F;&#x540D;<span class="hljs-string">\t</span>&#x6821;&#x540D;<span class="hljs-string">\t</span>&#x6821;&#x540D;&#xFF08;&#x77ED;&#xFF09;<span class="hljs-string">\t</span>&#x56FD;&#x5BB6;<span class="hljs-string">\t</span>&#x552F;&#x4E00;&#x7684;&#x6821;&#x540D;&#x5916;&#x90E8;ID</span><br></pre></td></tr></tbody></table></figure><p></p><h5><span id="teams-tsv-yang-li"><code>teams.tsv</code> &#x6837;&#x4F8B;</span><a href="#teams-tsv-yang-li" class="header-anchor">#</a></h5><p></p><figure class="highlight angelscript hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">File_Version    <span class="hljs-number">1</span></span><br><span class="line"><span class="hljs-number">1391</span>springA1391<span class="hljs-number">3</span>nameBeihang UniversityBUAACHNBUAA</span><br></pre></td></tr></tbody></table></figure><p></p><h4><span id="dao-ru-accounts-tsv">&#x5BFC;&#x5165; <code>accounts.tsv</code></span><a href="#dao-ru-accounts-tsv" class="header-anchor">#</a></h4><p><code>accounts.tsv</code> &#x5BFC;&#x5165;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x53BB;&#x6302;&#x961F;&#x4F0D;ID&#xFF0C;<!---->&#x4F46;&#x65B9;&#x5F0F;&#x662F;&#x8DF3;&#x8FC7; <code>username</code> &#x524D;&#x9762;&#x7684;&#x975E;&#x6570;&#x5B57;&#x5B57;&#x7B26;&#x3001;&#x518D;&#x8DF3;&#x8FC7; <code>0</code> &#x4EE5;&#x540E;&#xFF0C;<!---->&#x4EE5;&#x5269;&#x4E0B;&#x7684;&#x6570;&#x5B57;&#x5B57;&#x7B26;&#x4F5C;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;&#x961F;&#x4F0D;ID&#xFF08;&#x5269;&#x4E0B;&#x7684;&#x4E0D;&#x662F;&#x6570;&#x5B57;&#x5C31;&#x4E0D;&#x6302;&#x961F;&#x4F0D;&#x4E86;&#xFF09;&#x3002;<!---->&#x5BF9;&#x5E94;&#x7684;&#x6E90;&#x7801;&#xFF1A;<br></p><figure class="highlight lsl hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$teamid = preg_replace(&apos;/^[^<span class="hljs-number">0</span><span class="hljs-number">-9</span>]*<span class="hljs-number">0</span>*([<span class="hljs-number">0</span><span class="hljs-number">-9</span>]+)$/&apos;, &apos;\<span class="hljs-number">1</span>&apos;, $line[<span class="hljs-number">2</span>]);</span><br></pre></td></tr></tbody></table></figure><p></p><h5><span id="accounts-tsv-ge-shi"><code>accounts.tsv</code> &#x683C;&#x5F0F;</span><a href="#accounts-tsv-ge-shi" class="header-anchor">#</a></h5><p></p><figure class="highlight livescript hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">File_Version    <span class="hljs-number">1</span></span><br><span class="line">&#x89D2;&#x8272;&#xFF08;team, admin&#x7B49;&#xFF09;<span class="hljs-string">\t</span>&#x540D;&#x5B57;<span class="hljs-string">\t</span>username<span class="hljs-string">\t</span>password</span><br></pre></td></tr></tbody></table></figure><p></p><h5><span id="accounts-tsv-yang-li"><code>accounts.tsv</code> &#x6837;&#x4F8B;</span><a href="#accounts-tsv-yang-li" class="header-anchor">#</a></h5><p></p><figure class="highlight angelscript hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">File_Version    <span class="hljs-number">1</span></span><br><span class="line">teamChielochielo<span class="hljs-symbol">P@</span>ssw0rd</span><br></pre></td></tr></tbody></table></figure><p></p><h2><span id="judgehost">judgehost</span><a href="#judgehost" class="header-anchor">#</a></h2><h3><span id="bu-shu">&#x90E8;&#x7F72;</span><a href="#bu-shu" class="header-anchor">#</a></h3><p>&#x5728; <a href="https://www.domjudge.org/docs/admin-manual.html" target="_blank" rel="noopener">admin manual</a> &#x4E2D;&#x7684; Quick installation &#x4ECB;&#x7ECD;&#x4E86;&#x5927;&#x81F4;&#x7684;&#x6D41;&#x7A0B;</p><blockquote><p>On the judgehosts:</p><ul><li><code>useradd -d /nonexistent -U -M -s /bin/false domjudge-run</code></li><li>Add to <code>/etc/sudoers.d/</code> or append to <code>/etc/sudoers</code> the sudoers configuration as in etc/sudoers-domjudge. &#xFF08;&#x63A8;&#x8350;&#x524D;&#x8005;&#xFF09;</li><li>Set up cgroup support: enable kernel parameters in <code>/etc/default/grub</code> and reboot, then use <code>misc/create_cgroups</code> to create cgroups for DOMjudge.</li><li>Put the right credentials in the file <code>etc/restapi.secret</code> on all judgehosts (copied from the domserver). &#xFF08;&#x6B63;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;build &#x597D;&#x540E; install &#x4E0D;&#x4F1A;&#x9700;&#x8981;&#x8FD9;&#x4E00;&#x6B65;&#xFF09;</li><li>Start the judge daemon: <code>bin/judgedaemon</code> &#xFF08;&#x63A8;&#x8350;&#x7528; screen &#x5355;&#x72EC;&#x8DD1;&#xFF09;</li></ul></blockquote><p>&#x4F46;&#x8FD9;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x6839;&#x636E; admin manual &#x540E;&#x6587;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x3002;</p><h4><span id="cgroups">cgroups</span><a href="#cgroups" class="header-anchor">#</a></h4><p>&#x201C;enable kernel parameters in <code>/etc/default/grub</code> and reboot&#x201D; &#x9700;&#x8981;&#x53C2;&#x8003;&#x8282; &#x201C;Linux Control Groups&#x201D;<!----> &#x4FEE;&#x6539;&#x540E;&#x8FD0;&#x884C; <code>update-grub</code>&#xFF0C;&#x5426;&#x5219;&#x53EA;&#x4FEE;&#x6539; <code>/etc/default/grub</code> &#x91CD;&#x542F;&#x4E5F;&#x4E0D;&#x4F1A;&#x8D77;&#x6548;&#x3002;</p><p>&#x8FD0;&#x884C; judgehost &#x524D;&#x8BB0;&#x5F97;&#x8FD0;&#x884C; <code>create_cgroups</code>&#xFF0C;&#x5EFA;&#x7ACB; cgroups&#x3002;</p><h4><span id="dan-ji-duo-judgehosts">&#x5355;&#x673A;&#x591A; judgehosts</span><a href="#dan-ji-duo-judgehosts" class="header-anchor">#</a></h4><p>&#x6BD4;&#x5982;&#x6211;&#x60F3;&#x7528; <code>judgehost/bin/judgedaemon -n 2</code> &#x5728;&#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BC4;&#x6D4B;&#x673A;&#xFF0C;<!---->&#x5219;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x6B21; <code>useradd -d /nonexistent -U -M -s /bin/false domjudge-run-2</code> &#x5EFA;&#x7ACB;&#x7528;&#x6237;&#x3002;</p><h3><span id="yun-xing-ji-zhi">&#x8FD0;&#x884C;&#x673A;&#x5236;</span><a href="#yun-xing-ji-zhi" class="header-anchor">#</a></h3><p>&#x5728;&#x642D;&#x5EFA;&#x597D;&#x7684; domjudge &#x7684; jury interface &#x4E2D;&#xFF0C;&#x4F1A;&#x6709; Languages &#x548C; Executables &#x7684;&#x914D;&#x7F6E;&#x3002;<!---->&#x8FD9;&#x4E9B;&#x51B3;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x4EA4;&#xFF0C;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x600E;&#x4E48;&#x6D4B;&#x3002;</p><h4><span id="time-factor">Time factor</span><a href="#time-factor" class="header-anchor">#</a></h4><p>&#x5B9E;&#x9645;&#x662F; <strong>Time limitation factor</strong>&#xFF0C;&#x5373;&#x539F;&#x9898;&#x9762;&#x7684;&#x65F6;&#x9650;&#x4E58;&#x8FD9;&#x4E2A;&#x56E0;&#x5B50;&#x4F5C;&#x4E3A;&#x8BE5;&#x8BED;&#x8A00;&#x7684;&#x65F6;&#x9650;&#x3002;<!---->&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x7ED9; Java &#x914D;&#x7F6E;&#x4E24;&#x500D;&#x7684; Time factor&#xFF0C;&#x8FD9;&#x6837; 1 &#x79D2;&#x949F;&#x65F6;&#x9650;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x4F7F;&#x7528; Java &#x63D0;&#x4EA4;&#x7684;&#x8BDD;&#x65F6;&#x9650;&#x4F1A;&#x653E;&#x5BBD;&#x5230; 2 &#x79D2;&#x949F;&#x3002;</p><h4><span id="compile-script">Compile script</span><a href="#compile-script" class="header-anchor">#</a></h4><p>&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x8D1F;&#x8D23;&#x7F16;&#x8BD1;&#x53C2;&#x8D5B;&#x8005;&#x63D0;&#x4EA4;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A; shell &#x811A;&#x672C;&#x3002;<!---->&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x8868;&#x793A;&#x8981;&#x6C42;&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x6709; executable &#x6743;&#x9650;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x3002;</p><p>&#x6BD4;&#x5982; C++&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x751F;&#x6210;&#x5230;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#x4E0A;&#xFF1B;<!---->Java&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6709; executable &#x6743;&#x9650;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x8C03;&#x7528; <code>java</code> &#x53BB;&#x8FD0;&#x884C;&#x3002;</p><p><strong>&#x7F16;&#x8BD1;&#x65F6;&#x662F;&#x5728; <code>judgedaemon</code> &#x8FD0;&#x884C;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4EE5; <code>domjudge-run</code> &#x7528;&#x6237;&#x8FD0;&#x884C;&#x7684;&#x3002;</strong></p><h4><span id="chroot">chroot</span><a href="#chroot" class="header-anchor">#</a></h4><p>Compile script &#x7F16;&#x8BD1;&#x540E;&#xFF0C;&#x8FD0;&#x884C;&#x7F16;&#x8BD1;&#x5F97;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;<!----><strong>&#x662F;&#x5C06;&#x4E4B;&#x524D;&#x5EFA;&#x7ACB;&#x597D;&#x7684; chroot &#x73AF;&#x5883;&#x4E2D;&#x7684;&#x82E5;&#x5E72;&#x76EE;&#x5F55;&#xFF0C;&#x6302;&#x8F7D;&#x5230;<!----> <code>judgehost/judgings/&#x4E3B;&#x673A;&#x540D;/endpoint-default/&#x63D0;&#x4EA4;id/</code> &#x76F8;&#x5E94;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x3002;</strong></p><p>&#x56E0;&#x6B64;&#x5728;&#x66F4;&#x65B0;&#x4E3B;&#x673A;&#x7684;&#x73AF;&#x5883;&#x540E;&#xFF0C;chroot &#x76F8;&#x5E94;&#x7684;&#x73AF;&#x5883;&#x4E5F;&#x5E94;&#x5F53;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x540C;&#x6B65;&#x7248;&#x672C;&#x3002;</p><p>&#x82E5;&#x6709;&#x591A;&#x53F0;&#x8BC4;&#x6D4B;&#x673A;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x540C;&#x6B65;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3002;</p><h2><span id="kotlin">kotlin</span><a href="#kotlin" class="header-anchor">#</a></h2><p>&#x63A8;&#x8350;&#x4F7F;&#x7528; <a href="https://github.com/JetBrains/kotlin/releases" target="_blank" rel="noopener">JetBrains &#x5B98;&#x65B9; Github &#x4E2D;&#x7684; Release</a>&#x3002;</p><p>&#x5728; judgehost &#x7684;&#x4E3B;&#x673A;&#x4E2D;&#xFF0C;&#x914D;&#x7F6E;&#x5230;&#x8BA9;&#x5404;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x8C03;&#x7528; <code>kotlinc</code>&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1; Kotlin &#x7A0B;&#x5E8F;&#x3002;</p><p>&#x5728; judgehost &#x7684; chroot &#x73AF;&#x5883;&#x4E2D;&#xFF0C;<!---->&#x5C06; <code>lib</code> &#x7684;&#x5185;&#x5BB9;&#x89E3;&#x538B;&#x5230; <code>chroot</code> &#x4E2D;&#x7684; <code>lib</code>&#xFF0C;<!----><code>bin</code> &#x7684;&#x5185;&#x5BB9;&#x89E3;&#x538B;&#x5230; <code>chroot</code> &#x4E2D;&#x7684; <code>bin</code>&#xFF0C;<!---->&#x5C06; <code>chroot/bin</code> &#x4E2D;&#x7684; <code>kotlin</code> &#x7B49;&#x94FE;&#x63A5;&#x5230; <code>chroot/usr/bin</code> &#x4E2D;&#xFF0C;<!---->&#x8FD9;&#x6837;&#x7F16;&#x8BD1;&#x5F97;&#x5230;&#x7684; Kotlin &#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x5728; judgehost &#x7684; chroot &#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x4E86;&#x3002;</p></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;blockquote&gt;
&lt;p&gt;DOMjudge &amp;#x7248;&amp;#x672C;&amp;#xFF1A;6.0.3&lt;/p&gt;
&lt;/blockquote&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="随记" scheme="https://chielonewctle.github.io/categories/%E9%9A%8F%E8%AE%B0/"/>
    
    
      <category term="DOMjudge" scheme="https://chielonewctle.github.io/tags/DOMjudge/"/>
    
  </entry>
  
  <entry>
    <title>BZOJ 2115, HDU 5544 最大化无向图可重复路径边权异或和</title>
    <link href="https://chielonewctle.github.io/2018/11/13/connected-undirected-path-xor/"/>
    <id>https://chielonewctle.github.io/2018/11/13/connected-undirected-path-xor/</id>
    <published>2018-11-13T16:00:00.000Z</published>
    <updated>2020-04-13T00:36:50.680Z</updated>
    
    <content type="html"><![CDATA[<html><head></head><body><h2><span id="ti-yi">&#x9898;&#x610F;</span><a href="#ti-yi" class="header-anchor">#</a></h2><p>&#x4E24;&#x4E2A;&#x9898;&#x7684;&#x9898;&#x610F;&#x57FA;&#x672C;&#x76F8;&#x540C;&#x3002;</p><p>&#x6C42;&#x8FDE;&#x901A;&#x65E0;&#x5411;&#x56FE;&#x7684;&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x7ECF;&#x8FC7;&#x70B9;&#x3001;&#x8FB9;&#xFF0C;&#x4F7F;&#x5F97;&#x8DEF;&#x5F84;&#x8FB9;&#x6743;&#x7684;&#x5F02;&#x6216;&#x548C;&#x6700;&#x5927;&#x3002; </p><a id="more"></a><div class="toc"><!-- toc --><ul><li><a href="#ti-jie">&#x9898;&#x89E3;</a></li><li><a href="#zheng-ming-duan">&#x8BC1;&#x660E;&#xFF08;&#x77ED;&#xFF09;</a></li><li><a href="#zheng-ming-chang">&#x8BC1;&#x660E;&#xFF08;&#x957F;&#xFF09;</a><ul><li><a href="#wu-xiang-tu-hui-lu-de-bian-quan-de-yi-huo-he-ke-you-xiao-huan-zu-cheng">&#x65E0;&#x5411;&#x56FE;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x7684;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x53EF;&#x7531;<em>&#x5C0F;&#x73AF;</em>&#x7EC4;&#x6210;</a></li><li><a href="#xiao-huan-de-ren-yi-zu-he-ke-yi-you-hui-lu-xiang-dui-ying"><em>&#x5C0F;&#x73AF;</em>&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x56DE;&#x8DEF;&#x76F8;&#x5BF9;&#x5E94;</a></li><li><a href="#zong-jie">&#x603B;&#x7ED3;</a></li></ul></li><li><a href="#dai-ma">&#x4EE3;&#x7801;</a></li></ul><!-- tocstop --></div><h2><span id="ti-jie">&#x9898;&#x89E3;</span><a href="#ti-jie" class="header-anchor">#</a></h2><blockquote><p>&#x5DF2;&#x77E5;&#x4E00;&#x7EC4;&#x6570;&#xFF0C;&#x6C42;&#x9009;&#x51FA;&#x82E5;&#x5E72;&#x4E2A;&#x503C;&#x4F7F;&#x5F97;&#x5F02;&#x6216;&#x548C;&#x6700;&#x5927;&#x3002;</p></blockquote><p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x7EBF;&#x6027;&#x57FA;&#x4E2D;&#x8D2A;&#x5FC3;&#x6784;&#x9020;&#x51FA;&#x7B54;&#x6848;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x9898;&#xFF0C;DFS &#x540E;&#x4F1A;&#x5C06;&#x8FB9;&#x5206;&#x4E3A;&#x6811;&#x8FB9;&#x548C;&#x975E;&#x6811;&#x8FB9;&#x3002;&#x6C42;&#x51FA;&#x6240;&#x6709;&#x53EA;&#x6709;&#x4E00;&#x6761;&#x975E;&#x6811;&#x8FB9;&#x6784;&#x6210;&#x7684;&#x7B80;&#x5355;&#x73AF;&#xFF0C;&#x4EE5;&#x8FD9;&#x4E9B;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x201C;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x201D;&#x6784;&#x9020;&#x7EBF;&#x6027;&#x57FA;&#xFF0C;&#x8D2A;&#x5FC3;&#x6C42;&#x7B54;&#x6848;&#x5373;&#x53EF;&#x3002;</p><p>&#xFF08;&#x6240;&#x6709;&#x53EA;&#x6709;&#x4E00;&#x6761;&#x975E;&#x6811;&#x8FB9;&#x6784;&#x6210;&#x7684;&#x73AF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF1A;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x6839;&#x5230;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C; \(a_u\) &#x540E;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x975E;&#x6811;&#x8FB9; \((u, v, w)\) &#x7B97;&#x4E00;&#x4E0B; \(a_u \oplus a_v \oplus w\) &#x5373;&#x53EF;&#xFF0C;&#x516C;&#x5171;&#x7956;&#x5148;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x8FB9;&#x6743;&#x4F1A;&#x5F02;&#x6216;&#x6210; \(0\) &#x7684;&#x3002;&#xFF09;</p><p>BZOJ 2115 &#x9700;&#x8981;&#x9009;&#x4E00;&#x6761; \(1\) ~ \(n\) &#x7684;&#x8DEF;&#x5F84;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x8D2A;&#x5FC3;&#x4F18;&#x5316;&#x7B54;&#x6848;&#xFF1B;&#x5BF9;&#x4E8E; HDU 5544&#xFF0C;&#x76F4;&#x63A5;&#x4ECE; \(0\) &#x8D2A;&#x5FC3;&#x3002;</p><h2><span id="zheng-ming-duan">&#x8BC1;&#x660E;&#xFF08;&#x77ED;&#xFF09;</span><a href="#zheng-ming-duan" class="header-anchor">#</a></h2><ul><li>&#x4E3B;&#x8981;&#x5173;&#x5FC3;&#x7684;&#x8FD8;&#x662F;&#x8D70;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x8FB9;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FB9;&#x7684;&#x8FB9;&#x6743;&#x5BF9;&#x7B54;&#x6848;&#x6709;&#x8D21;&#x732E;&#x3002;</li></ul><ul><li>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56DE;&#x8DEF;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x975E;&#x6811;&#x8FB9;&#x8D70;&#x4E86;&#x5947;&#x6570;&#x6B21;&#xFF0C;&#x90A3;&#x4F60;&#x53EF;&#x4EE5;&#x987A;&#x7740;&#x6811;&#x8FB9;&#x7ED5;&#x8FC7;&#x53BB;&#x8D70;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x975E;&#x6811;&#x8FB9;&#x518D;&#x539F;&#x8DEF;&#x56DE;&#x53BB;&#xFF1B;</li><li>&#x975E;&#x6811;&#x8FB9;&#x4E2D;&#x8D70;&#x8FC7;&#x6B21;&#x6570;&#x7684;&#x5947;&#x5076;&#x6027;&#x4E5F;&#x53EA;&#x6709;&#x8FD9;&#x6761;&#x8FB9;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x88AB;&#x8D70;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#xFF1B;</li><li>&#x800C;&#x8FD9;&#x4E2A;&#x65B0;&#x52A0;&#x7684;&#x8DEF;&#x5F84;&#x7684;&#x5F02;&#x6216;&#x503C;&#x5C31;&#x662F;&#x5305;&#x542B;&#x8FD9;&#x6761;&#x975E;&#x6811;&#x8FB9;&#x7684;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF1B;</li><li>&#x6D88;&#x6765;&#x6D88;&#x53BB;&#x56DE;&#x8DEF;&#x4E0A;&#x5C31;&#x6CA1;&#x6709;&#x975E;&#x6811;&#x8FB9;&#x8D70;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x4E86;&#xFF0C;&#x800C;&#x53C8;&#x4E0D;&#x80FD;&#x4EC5;&#x6709;&#x6811;&#x8FB9;&#x8D70;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x65F6;&#x6240;&#x6709;&#x8FB9;&#x5DF2;&#x7ECF;&#x90FD;&#x88AB;&#x8D70;&#x8FC7;&#x5076;&#x6570;&#x6B21;&#x4E86;&#xFF0C;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x662F; \(0\)&#x3002;</li><li>&#x6240;&#x4EE5;&#x5BF9;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56DE;&#x8DEF;&#xFF0C;&#x603B;&#x80FD;&#x6709;&#x4E00;&#x7EC4;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x5F02;&#x6216;&#xFF0C;&#x4E0E;&#x8FD9;&#x4E2A;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</li></ul><ul><li><em>&#x5C0F;&#x73AF;</em>&#x7684;&#x968F;&#x4FBF;&#x7EC4;&#x5408;&#x540E;&#xFF0C;&#x4ECE;&#x6839;&#x51FA;&#x53D1;&#x7ED5;&#x8FD9;&#x4E9B;<em>&#x5C0F;&#x73AF;</em>&#x90FD;&#x8D70;&#x4E00;&#x904D;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x6784;&#x9020;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x56DE;&#x8DEF;&#xFF0C;&#x4F7F;&#x5F97;&#x8D70;&#x8FC7;&#x7684;&#x5947;&#x6570;&#x6B21;&#x7684;&#x8FB9;&#x96C6;&#xFF0C;&#x548C;&#x8FD9;&#x4E9B;<em>&#x5C0F;&#x73AF;</em>&#x5F02;&#x6216;&#x51FA;&#x6765;&#x7684;&#x8FB9;&#x96C6;&#x76F8;&#x540C;&#x3002;</li><li>&#x6240;&#x4EE5;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x968F;&#x610F;&#x7EC4;&#x5408;&#x3001;&#x5F02;&#x6216;&#xFF0C;&#x603B;&#x80FD;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x4E0E;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</li></ul><ul><li>&#x7EFC;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x548C;&#x82E5;&#x5E72;<em>&#x5C0F;&#x73AF;</em>&#x968F;&#x610F;&#x7EC4;&#x5408;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x96C6;&#x5408;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x95EE;&#x9898;&#x5C31;&#x80FD;&#x89C4;&#x7EA6;&#x5230;<a href="#ti-jie">&#x9898;&#x89E3;</a>&#x6240;&#x8BF4;&#x7684;&#x505A;&#x6CD5;&#x3002;</li></ul><h2><span id="zheng-ming-chang">&#x8BC1;&#x660E;&#xFF08;&#x957F;&#xFF09;</span><a href="#zheng-ming-chang" class="header-anchor">#</a></h2><p>&#x4EE5;&#x4E0B;&#x57FA;&#x4E8E; HDU 5544 &#x7684;&#x9898;&#x9762;&#x8FDB;&#x884C;&#x8BC1;&#x660E;&#x3002;</p><p>&#x4E0B;&#x9762;&#x7EDF;&#x4E00;&#x79F0;&#x201C;DFS &#x540E;&#x3001;&#x53EA;&#x6709;&#x4E00;&#x6761;&#x975E;&#x6811;&#x8FB9;&#x6784;&#x6210;&#x7684;&#x7B80;&#x5355;&#x73AF;&#x201D;&#x4E3A;<em>&#x5C0F;&#x73AF;</em>&#x3002;</p><h3><span id="wu-xiang-tu-hui-lu-de-bian-quan-de-yi-huo-he-ke-you-xiao-huan-zu-cheng">&#x65E0;&#x5411;&#x56FE;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x7684;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x53EF;&#x7531;<em>&#x5C0F;&#x73AF;</em>&#x7EC4;&#x6210;</span><a href="#wu-xiang-tu-hui-lu-de-bian-quan-de-yi-huo-he-ke-you-xiao-huan-zu-cheng" class="header-anchor">#</a></h3><blockquote><p>&#x5BF9;&#x4E8E;&#x8FDE;&#x901A;&#x7684;&#x65E0;&#x5411;&#x56FE;&#xFF0C;&#x4EFB;&#x610F;&#x7684;&#x4E00;&#x6761;&#x53EF;&#x91CD;&#x590D;&#x7ECF;&#x8FC7;&#x70B9;&#x3001;&#x8FB9;&#x7684;&#x56DE;&#x8DEF;&#xFF0C;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x53EF;&#x4EE5;&#x7531;&#x82E5;&#x5E72;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x5F02;&#x6216;&#x5F97;&#x5230;&#x3002;</p></blockquote><p>&#x8BB0;&#x8FD9;&#x4E2A;&#x56DE;&#x8DEF;&#x4E3A; \(D\)&#xFF0C;&#x8D77;&#x70B9;&#x4E3A; \(S\)&#xFF0C;&#x7EC8;&#x70B9;&#x4E3A; \(T\)&#xFF0C;&#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x8FB9;&#x96C6;&#x4E3A; \(C\)&#x3002;</p><ul><li>\(S = T\)&#x3002;</li></ul><ul><li>&#x56DE;&#x8DEF; \(D\) &#x7684;&#x8FB9;&#x6743;&#x7684;&#x5F02;&#x6216;&#x548C;&#x7B49;&#x4E8E; \(C\) &#x8FB9;&#x6743;&#x7684;&#x5F02;&#x6216;&#x548C;&#x3002;</li></ul><ul><li>&#x82E5; \(C\) &#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x975E;&#x6811;&#x8FB9;&#xFF0C;&#x5373;&#x975E;&#x6811;&#x8FB9;&#x90FD;&#x7ECF;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#x3002;<ul><li>&#x5047;&#x8BBE;&#x6709;&#x6811;&#x8FB9; \(e = (u, v, w)\) &#x5728;&#x8FB9;&#x96C6; \(C\) &#x4E2D;&#x3002;<ul><li>&#x6811;&#x8FB9; \(e\) &#x628A; DFS &#x6811;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8054;&#x901A;&#x5757; \(A\), \(B\)&#xFF1B;</li><li>&#x7531;&#x4E8E;&#x975E;&#x6811;&#x8FB9;&#x6700;&#x7EC8;&#x90FD;&#x53EA;&#x7ECF;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#xFF0C;&#x6309;&#x56DE;&#x8DEF;&#x7684;&#x987A;&#x5E8F;&#x5728;&#x70B9;&#x95F4;&#x79FB;&#x52A8;&#xFF0C;\(e\) &#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x3001;&#x975E;&#x6811;&#x8FB9;&#x7ECF;&#x8FC7;&#x5076;&#x6570;&#x6B21;&#x4EE5;&#x540E;&#xFF0C;&#x5FC5;&#x7136;&#x8D77;&#x70B9; \(S\) &#x548C;&#x7EC8;&#x70B9; \(T\) &#x5206;&#x522B;&#x5904;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8054;&#x901A;&#x5757; \(A\), \(B\) &#x4E2D;&#xFF1B;</li><li>&#x8FD9;&#x6837;&#x6709; \(S \ne T\)&#xFF0C;&#x77DB;&#x76FE;&#x3002;</li></ul></li><li>&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x6709;&#x6811;&#x8FB9;&#x53EA;&#x7ECF;&#x8FC7;&#x4E86;&#x5947;&#x6570;&#x6B21;&#xFF0C;\(C\) &#x4E2D;&#x53C8;&#x6CA1;&#x6709;&#x975E;&#x6811;&#x8FB9;&#xFF0C;&#x6240;&#x4EE5; \(C\) &#x4E3A;&#x7A7A;&#x96C6;&#x3002;</li><li>&#x6240;&#x4EE5;&#x6240;&#x6709;&#x8FB9;&#x90FD;&#x53EA;&#x7ECF;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#xFF0C;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x4E3A; \(0\)&#x3002;</li></ul></li></ul><ul><li>&#x82E5; \(C\) &#x4E2D;&#xFF0C;&#x6709;&#x975E;&#x6811;&#x8FB9;&#x3002;<ul><li>&#x8BB0; \(C\) &#x4E2D;&#x67D0;&#x4E2A;&#x975E;&#x6811;&#x8FB9;&#x4E3A; \(e = (e_u, e_v, e_w)\)&#xFF1B;</li><li>&#x8BB0;<em>&#x5C0F;&#x73AF;</em>&#x4E2D;&#xFF0C;&#x5305;&#x542B; \(e\) &#x7684;&#x7B80;&#x5355;&#x73AF;&#x4E3A; \(D_e\)&#x3002;</li><li>&#x6309;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF0C;&#x5728;&#x4E0D;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x975E;&#x6811;&#x8FB9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x56DE;&#x8DEF; \(D&#x2019;\) &#x4F7F;&#x5F97; \(e\) &#x7ECF;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#xFF1A;<ul><li>&#x4ECE; \(C\) &#x4E2D;&#x7684;&#x8D77;&#x70B9; \(S\) &#x51FA;&#x53D1;&#xFF0C;<strong>&#x53EA;&#x7ECF;&#x8FC7;&#x6811;&#x8FB9;</strong>&#xFF0C;&#x8D70;&#x5230;&#x70B9; \(e_u\) &#x540E;&#xFF0C;&#x6309; \(D_e\) &#x8D70;&#x4E00;&#x904D;&#x7B80;&#x5355;&#x73AF;&#xFF0C;&#x518D;&#x4ECE;&#x70B9; \(e_u\) <strong>&#x539F;&#x8DEF;&#x8FD4;&#x56DE;</strong>&#x81F3; \(S\)&#xFF0C;&#x8BB0;&#x8FD9;&#x4E2A;&#x56DE;&#x8DEF;&#x4E3A; \(P\)&#x3002;</li><li>&#x5C06;&#x8FD9;&#x4E2A;&#x56DE;&#x8DEF; \(P\) &#x62FC;&#x5230; \(D\) &#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x62FC;&#x6210;&#x8DEF;&#x5F84; \(D&#x2019;\)&#xFF0C;&#x663E;&#x7136; \(D&#x2019;\) &#x4F9D;&#x7136;&#x662F;&#x4E2A;&#x56DE;&#x8DEF;&#x3002;</li><li>&#x8BB0; \(D&#x2019;\) &#x4E2D;&#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x8FB9;&#x96C6;&#x4E3A; \(C&#x2019;\)&#x3002;</li><li>&#x7531;&#x4E8E;&#x56DE;&#x8DEF; \(P\) &#x4E2D;&#xFF0C;&#x53EA;&#x6709; \(D_e\) &#x7684;&#x8FB9;&#x7ECF;&#x8FC7;&#x4E86;&#x5947;&#x6570;&#x6B21;&#xFF0C;&#x800C; \(e\) &#x662F; \(P\) &#x4E2D;&#x552F;&#x4E00;&#x7684;&#x975E;&#x6811;&#x8FB9;&#xFF0C;&#x6240;&#x4EE5; \(P\) &#x4E2D;&#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x975E;&#x6811;&#x8FB9;&#x53EA;&#x6709; \(e\)&#x3002;</li><li>&#x6240;&#x4EE5;&#x5728; \(D&#x2019;\) &#x4E2D; \(e\) &#x603B;&#x5171;&#x7ECF;&#x8FC7;&#x4E86;&#x5076;&#x6570;&#x6B21;&#xFF0C;\(C&#x2019;\) &#x4E2D;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4E86; \(e\)&#x3002;</li><li>&#x5728; \(P\) &#x4E2D;&#x53C8;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x975E;&#x6811;&#x8FB9;&#xFF0C;&#x6240;&#x4EE5; \(C&#x2019;\) &#x4E2D;&#x4E5F;&#x6CA1;&#x6709;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x975E;&#x6811;&#x8FB9;&#x3002;</li></ul></li><li>&#x6211;&#x4EEC;&#x6210;&#x529F;&#x5730;&#x4ECE;&#x56DE;&#x8DEF;&#x7684;&#x7ECF;&#x8FC7;&#x5947;&#x6570;&#x6B21;&#x7684;&#x8FB9;&#x4E2D;&#xFF0C;&#x8E22;&#x6389;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x6811;&#x8FB9;&#x3002;</li><li>&#x5BF9;&#x4E8E;&#x7B54;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;&#x56DE;&#x8DEF; \(D&#x2019;\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C; \(ans&#x2019;\)&#xFF0C;&#x90A3;&#x4E48; \(D\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C; \(ans\) &#x5C31;&#x4E3A; \(ans&#x2019;\) &#x5F02;&#x6216;&#x4E0A;&#x7B80;&#x5355;&#x73AF; \(D_e\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x3002;</li></ul></li></ul><ul><li>&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x7684;&#x5F52;&#x7EB3;&#x8BC1;&#x660E;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x56DE;&#x8DEF; \(D\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x82E5;&#x5E72;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x5F02;&#x6216;&#x5F97;&#x5230;&#x3002;</li></ul><h3><span id="xiao-huan-de-ren-yi-zu-he-ke-yi-you-hui-lu-xiang-dui-ying"><em>&#x5C0F;&#x73AF;</em>&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x56DE;&#x8DEF;&#x76F8;&#x5BF9;&#x5E94;</span><a href="#xiao-huan-de-ren-yi-zu-he-ke-yi-you-hui-lu-xiang-dui-ying" class="header-anchor">#</a></h3><blockquote><p>&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;<em>&#x5C0F;&#x73AF;</em>&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x8D77;&#x70B9; \(S\) &#x7684;&#x56DE;&#x8DEF; \(D\)&#xFF0C;&#x4F7F;&#x5F97; \(D\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x6070;&#x597D;&#x7B49;&#x4E8E;&#x8FD9;&#x7EC4;&#x5C0F;&#x73AF;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x5F02;&#x6216;&#x548C;&#x3002;</p></blockquote><p>&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x5C0F;&#x73AF;&#xFF0C;&#x4ECE; \(S\) &#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x8D70;&#x5230;&#x5C0F;&#x73AF;&#x7684;&#x67D0;&#x4E2A;&#x70B9;&#x4E0A;&#xFF0C;&#x518D;&#x7ED5;&#x8FD9;&#x4E2A;&#x5C0F;&#x73AF;&#x8D70;&#x4E00;&#x5708;&#x540E;&#xFF0C;&#x539F;&#x8DEF;&#x8FD4;&#x56DE;&#x5230; \(S\) &#x70B9;&#x3002;</p><p>&#x8FD9;&#x6837;&#x628A;&#x6240;&#x6709;&#x5C0F;&#x73AF;&#x8D70;&#x4E00;&#x904D;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4ECE; \(S\) &#x51FA;&#x53D1;&#x7684;&#x56DE;&#x8DEF; \(D\)&#xFF0C;&#x5E76;&#x4E14;&#x663E;&#x7136; \(D\) &#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x5C0F;&#x73AF;&#x5404;&#x81EA;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x5F02;&#x6216;&#x548C;&#x3002;</p><h3><span id="zong-jie">&#x603B;&#x7ED3;</span><a href="#zong-jie" class="header-anchor">#</a></h3><p>&#x56DE;&#x8DEF;&#x3001;&#x5C0F;&#x73AF;&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x90FD;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x76F8;&#x7B49;&#x7684;&#x6620;&#x5C04;&#x3002;</p><p>&#x56E0;&#x6B64;&#x65E0;&#x5411;&#x56FE;&#x4E2D;&#xFF0C;&#x6C42;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x7ECF;&#x8FC7;&#x70B9;&#x3001;&#x8FB9;&#x7684;&#x56DE;&#x8DEF;&#x7684;&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x7B49;&#x540C;&#x4E8E;&#x6C42;<em>&#x5C0F;&#x73AF;</em>&#x8FB9;&#x6743;&#x5F02;&#x6216;&#x548C;&#xFF0C;&#x4EFB;&#x610F;&#x5F02;&#x6216;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p><h2><span id="dai-ma">&#x4EE3;&#x7801;</span><a href="#dai-ma" class="header-anchor">#</a></h2><ul><li><a href="/assets/src/practice/bzoj2115.cpp">BZOJ 2115</a></li><li><a href="/assets/src/practice/hdu5544.cpp">HDU 5544</a></li></ul></body></html>]]></content>
    
    <summary type="html">
    
      &lt;html&gt;&lt;head&gt;&lt;/head&gt;&lt;body&gt;&lt;h2 id=&quot;&amp;#x9898;&amp;#x610F;&quot;&gt;&lt;a href=&quot;#&amp;#x9898;&amp;#x610F;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x9898;&amp;#x610F;&quot;&gt;&lt;/a&gt;&amp;#x9898;&amp;#x610F;&lt;/h2&gt;&lt;p&gt;&amp;#x4E24;&amp;#x4E2A;&amp;#x9898;&amp;#x7684;&amp;#x9898;&amp;#x610F;&amp;#x57FA;&amp;#x672C;&amp;#x76F8;&amp;#x540C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6C42;&amp;#x8FDE;&amp;#x901A;&amp;#x65E0;&amp;#x5411;&amp;#x56FE;&amp;#x7684;&amp;#x4E00;&amp;#x6761;&amp;#x8DEF;&amp;#x5F84;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x91CD;&amp;#x590D;&amp;#x7ECF;&amp;#x8FC7;&amp;#x70B9;&amp;#x3001;&amp;#x8FB9;&amp;#xFF0C;&amp;#x4F7F;&amp;#x5F97;&amp;#x8DEF;&amp;#x5F84;&amp;#x8FB9;&amp;#x6743;&amp;#x7684;&amp;#x5F02;&amp;#x6216;&amp;#x548C;&amp;#x6700;&amp;#x5927;&amp;#x3002; &lt;/p&gt;&lt;/body&gt;&lt;/html&gt;
    
    </summary>
    
    
      <category term="题解" scheme="https://chielonewctle.github.io/categories/%E9%A2%98%E8%A7%A3/"/>
    
    
      <category term="BZOJ" scheme="https://chielonewctle.github.io/tags/BZOJ/"/>
    
      <category term="HDU" scheme="https://chielonewctle.github.io/tags/HDU/"/>
    
      <category term="无向图" scheme="https://chielonewctle.github.io/tags/%E6%97%A0%E5%90%91%E5%9B%BE/"/>
    
      <category term="线性基" scheme="https://chielonewctle.github.io/tags/%E7%BA%BF%E6%80%A7%E5%9F%BA/"/>
    
      <category term="回路" scheme="https://chielonewctle.github.io/tags/%E5%9B%9E%E8%B7%AF/"/>
    
  </entry>
  
</feed>
